{
   "Sub Reddit": "canada",
   "Post": [
      {
         "Title": "Justin Trudeau’s anti-Islamophobia disaster reveals a government dangerously out of touch with voters | The Star",
         "Body": "",
         "Id": "10tmwgm",
         "Comments": [
            {
               "Body": "Muslim here. More concerned about cost of living, corporate greed, inflation, housing crises and many other issues over having an anti-Islamophobia bureaucrat"
            },
            {
               "Body": "I don’t know that I’d call this example a disaster but I agree the gov’t seems dangerously out of touch. Thinking about the future gives me serious anxiety with all the bread and butter issues we’re facing. The Liberals don’t seem as focused as they should be on what’s most important. I often get the feeling with Trudeau and the current gov’t that they’re just waiting for these to issues to resolve themselves, fingers crossed. Ex: Let’s get more immigrants in here and see if that helps."
            },
            {
               "Body": "It’s not just this Liberal government, it’s always been the same story with the Libs. They just become arrogant and out of touch with voters so right now all Justin is doing is handing votes to the the Conservatives with these stupid decisions. Did we really need an anti-Islamaphobia representative or was it to get more Muslim votes?"
            },
            {
               "Body": "Next election is going to be such a dumpster fire for me. I'm pretty centrist with having no issue going to the right or left if a platform and policies sound good to me so I'm by no means the kind who sees political parties as \"my team\".\n\nI don't care for JT, PP or JS.\n\nHad the CPC stuck with O'Toole and gave him time to solidify his policies then I think they'd have a better chance for weirdos like me but they just booted him the same way they booted Scheer and will boot PP if he doesn't win."
            },
            {
               "Body": "Appointing an anti Islamophobia rep is a disaster"
            },
            {
               "Body": "You know it’s bad with the Toronto Star turns on the LPC"
            },
            {
               "Body": "My problem with quite a few of these Liberal policies such as anti-islam stuff is how they define this stuff.\n\nIt is almost more a zealot fever dream instead of thought out set of policies. They label it racist when people suggest that out of control immigration is causing part of the housing problem. Or racist when people ask that far less focus be put on native issues when there are so many other issues which could change the very course of our country.\n\nTo spend time on drag events instead of healthcare? I suspect people in the drag community would choose healthcare as the higher priority.\n\nSome issues aren't either/or, but things like healthcare, housing, debt, and inequality have reached crisis proportions and thus should be getting 100% of the attention possible from the top levels of government."
            },
            {
               "Body": "these articles are meant to distract from the incompetent government trudeau has"
            },
            {
               "Body": "Ya think?  \n\nThis government has been off the rails for most of it's tenure."
            },
            {
               "Body": "focusing on non-issues while millions of cdn’s are getting burned by housing and healthcare. seems like a liberal thing to do. trudeau is an idiot."
            },
            {
               "Body": "... the fact the government both federally and provincially do nothing for the housing crisis but deepen it and exaggerate it shows they are dangerously out of touch...this is just more fuel on the fire."
            },
            {
               "Body": "Government installing religious internet censors is a terrifying ordeal on many fronts. A complete breach of the separation of church and state. A brazen overstep into the civilian discourse necessary for our autonomy and the functioning of our democracy. This entire job should not exist. Our speech and our religions belong to us, not the government."
            },
            {
               "Body": "The way to solve racism and hate is to empower the racists and give them good government salaries."
            },
            {
               "Body": "You know things aren't going well right now for the Liberals if the Toronto Star are not liking something the Liberals are doing."
            },
            {
               "Body": "This dude is literally trying to import voters."
            },
            {
               "Body": "What, woke government distractions from shit policy is not working anymore?"
            },
            {
               "Body": "Islam subjugates women. Also, anti freedom of choice. One word, Iran."
            },
            {
               "Body": "Trudeau and the Liberals just want to get elected to make sure billionaires get richer while Canadians get poorer everyday. They love to get citizens fighting each other, it serves them well electorally."
            },
            {
               "Body": "Frankly I'm impressed that the Liberals were willing to pull the trigger on anti-islamophobia considering who the logical target would be.\n\nUnless they really are so incompetent they couldn't see this coming..."
            },
            {
               "Body": "A disaster across the board. Cdns know this.. look at the popular vote."
            },
            {
               "Body": "The more out of touch with voters, the better. Hopefully enough NPC’s will get this when the next election happens."
            },
            {
               "Body": "We need to build more housing in places where people want to live and as homes people want to live in. That’s literal the solution to the housing crisis and it’s insane that people don’t want to do that."
            },
            {
               "Body": "When the Star turns on Trudeau you know he’s in trouble."
            },
            {
               "Body": "Out of touch?  Definitely \n\nBut smart enough to determine each wedge issue that attracts enough votes to remain in power.  The divisive politics played by the Liberals is truly top notch.   Canadians now give full commitment over singular issues, regardless of track records or work performance."
            },
            {
               "Body": "Trudeau has done absolutely nothing the last 7 years, the only reason he stayed in power was that borrowing money was cheap, so no one complained. Now that the free money has stopped, his incompetence is showing."
            },
            {
               "Body": "They're not dangerously out of touch. We live in a fucked up system where a handful of jurisdictions in Ontario will determine the election, largely the GTA, which has a very large muslim population, many of which immigrated here in the last few years. They can alienate a much larger voting base in less important jurisdictions, and that's likely what they are doing. If they can get the uninformed virtue signaling voter, the property investor, and the muslim vote in the GTA, they will win the country."
            },
            {
               "Body": "Government's out of touch with voters...\nVoters are out of touch with reality...\n\nI didn't read the article. Just came here to write stuff."
            },
            {
               "Body": "No way rich people in Ottawa are out of touch. Libel I tell you, libel!"
            },
            {
               "Body": "Oh just give her a pension for life - it worked for Julie Paulette former Governor General. /s.   Must have had the same background check as Julie!"
            },
            {
               "Body": "The Islam is one of the gravest threats to the (western) world."
            },
            {
               "Body": "Didn’t she say that Quebec is anti Muslim because of the high % of people who were pro bill 21 and also had negative feels about Muslims?\n\nAm I missing something?"
            },
            {
               "Body": "So let me get this straight. She wrote an op-ed with a Jewish colleague, both correctly concluded a larger than average number of Quebecers have anti-Islamic sentiments - which is their right. But Quebec is offended she has a well defended opinion, and now they’re asking for her resignation? \n\nGive me a break. This is a manufactured PR distraction."
            },
            {
               "Body": "I'm shocked! SHOCKED!! Well, not that shocked."
            },
            {
               "Body": "Asking anti-islamaphobia questions is completely justified in Canada. When was the last time an entire Christian family was run down and killed because of their religion and background. Never... When was the last time a gunman killed 6 worshipers at a Christian church. Never...These are questions that must be faced like it or not."
            },
            {
               "Body": "Hear me out. The anti Islamophobia person owes French speaking people nothing. Her job is to advocate for Muslims not for bilingualism. And don’t at me I’m part French Canadian and zero Muslim"
            },
            {
               "Body": "The Star is dangerously out of touch with their readers if they think that we care about such nonsense"
            },
            {
               "Body": "Right wing media in Canada is getting more dangerous every day and nobody seems to be pushing back. Misleading headlines and click bait are everywhere. They want you to think our country is in crisis. The drip drip of negativity is destructive to our society. Postmedia and others are not as bad as fox…yet but they are getting there fast. We must not let this happen."
            },
            {
               "Body": "Anti-islamophia measures unpopular with Islamophobic voters."
            },
            {
               "Body": "OP is quebecoi French.\n\nWrites damning article in the most white way \"I am not racist, this is a bomb\" \n\nEntire piece oozing with bias\n\n\nYou know its shit when the news needs op ed to make money"
            },
            {
               "Body": "I mean polls haven't shown much movement at all with Liberals holding 34-31 percent among the top firms"
            },
            {
               "Body": "Sure is a good thing Quebecers are over that whole pure laine thing."
            },
            {
               "Body": "Sure , as if you havent been voting for the pander king for a decade…\n\nIt works cause you like it."
            },
            {
               "Body": "Political parties owned by their corporate sponsors, and that’s all of them, are the problem. https://www.facebook.com/groups/47795612917/?ref=share_group_link"
            },
            {
               "Body": "Yaaaawwwwn. Y'all still think the star is news?"
            },
            {
               "Body": "The star is out touch of with the public. Similar things have been going on for years with JT’s government. The ppl at star should read the post or the sun more often."
            },
            {
               "Body": "The disaster is the fact we needed someone to be anti-islamaphobic in the first place. For fuck sakes people, this shit is fucking embarrassing. Racist idiots all over this fucking country, smh."
            },
            {
               "Body": "Ah so now we get to see the new conservative owners exerting some editorial pressure."
            },
            {
               "Body": "Lol. I believe every politician is out touch with voters. If we’re looking for heroes,  there sure not any in parliament"
            },
            {
               "Body": "Voters out of touch with what the government does."
            },
            {
               "Body": "What is with the hyperbole about an irrelevant stupid nonsense topic ? Is \"thestar.com\" a journal for the dumdumbs ? \n\nIsn't there something actually important to discuss ?"
            }
         ]
      },
      {
         "Title": "Federal government is in a tight fiscal environment, Freeland says ahead of health talks",
         "Body": "",
         "Id": "10tfg5i",
         "Comments": [
            {
               "Body": "So leading up to the premiers meeting with Trudeau, Freeland is basically saying there is no more money to give them for healthcare."
            },
            {
               "Body": "This is really a question of will the federal government have to raise taxes or will the provincial governments have to raise taxes eventually? That much healthcare funding has to come from somewhere."
            },
            {
               "Body": "Meanwhile a handful of companies made billions in Canada and paid fuck all for taxes."
            },
            {
               "Body": "And this is why you don't run large deficits during good economic times. Now the debt we took on has to be paid back with high interest rates and we don't have the money we need to invest in critical services like Healthcare. Looks like the feds tacitly endorsed private Healthcare schemes because the public treasury is empty. Nothing warms my heart as a taxpayer then to have a government squander my hard earned tax payer money on their pet projects and cronyism."
            },
            {
               "Body": "The one area they don’t want to spend the most amount of money in the least amount of time."
            },
            {
               "Body": "They racked up a trillion in debt that didn’t include any infrastructure investment. It’s just gone. \n\nNow they are saying because of this, they can’t invest in infrastructure."
            },
            {
               "Body": "They have been pissing money out in every direction but when it comes to supporting Canadians the shrug and say there is no money. ffs these people are sacks of shit."
            },
            {
               "Body": "So when it comes to health spending for Canadians, now we’re suddenly tight. This woman is a clown."
            },
            {
               "Body": "You get what you vote for."
            },
            {
               "Body": "The Canadian government has been throwing billions around on pet projects for years.  They love the new program spending but when it comes to properly supporting existing programs there is no money.  The Canadian government even before Trudeau were neglectful of education and healthcare.  It’s time to cut out many of these newer programs and put the money where it should have been spent in the first place.  The government cannot fix all problems. The fact that people seem to think so it ridiculous."
            },
            {
               "Body": "Did she ever mention where that 2 billion worth of tax money is going?"
            },
            {
               "Body": "You know it's bad when liberals _admit_ that they've wasted all our money."
            },
            {
               "Body": "If I ran my finances the way they did, I'd be in jail."
            },
            {
               "Body": "LOL there was hundreds of billions available for corporate handouts the last few years. $100B earmarked for stimulus that they were unsure how to spend. A newly created $15B \"green\" slush-fund that has no actual projects or companies assigned to it.\n\nMoney for our failing healthcare system? No. Sorry folks but we seem to have suddenly run out of money...."
            },
            {
               "Body": "Maybe they could spend less on consultants, or cut back on the embezzlement by ministers.\n\nOf all the things this government has recklessly spent our money on, it's telling that healthcare is where the line is for them.\n\nWhat has happened with all of the money they've spent? Infrastructure hasn't improved, it's gotten worse, no new hospitals built, barely any movement on affordable housing. \n\nWe should take after France right now."
            },
            {
               "Body": "Then raise taxes on the rich and corporations, for Christ sakes. Don’t act like killing people is the only solution (ie suicides go up during recessions)."
            },
            {
               "Body": "Where did the money go? Money doesn't vanish into thin air. If the people don't have it, and the government doesn't have it... it's almost like billionaires and megacorps are making record profits or something."
            },
            {
               "Body": "Tax the rich."
            },
            {
               "Body": "Caused they pissed it all away, plus they will not allow the export of oil and gas so they are not bringing in any money into the country to support its stupid spending."
            },
            {
               "Body": "Why is that? Only one year ago, she was acting as if the Canadian government can let Canadians sit at home and still will be fine. She destroyed the economy while listening to the covid profiteers."
            },
            {
               "Body": "Healthcare funding is non negotiable. It is a right, not a privilege."
            },
            {
               "Body": "Sometimes it really feels like the government hates us and wishes us harm."
            },
            {
               "Body": "Federal Government needs to cancel their Disney+"
            },
            {
               "Body": "A great time to initiate a gun buyback?"
            },
            {
               "Body": "I love how she’s the face of “fiscal responsibility” among the LPC.\n\nWhat with her Russian literature background & canceling Disney+. I can’t imagine what she’s been though."
            },
            {
               "Body": "Wasn’t there just an article saying they didn’t know if they would bother recovering 100 million dollars from that Quebec company?"
            },
            {
               "Body": "*Federal government is in a tight fiscal environment*\n\nWow, you can't get much by her. Hey Chrissy maybe if your governemtn hadn't pissed away hundreds of billion in he last 7 + years there may be a little more dry powder left. \n\n*\"It means that we do need to behave with real fiscal responsibility,\" Freeland told a news conference following the meeting.*\n\nThis woman is beyond stupid but what is more distrubing are the idiots that still support and will vote for this party."
            },
            {
               "Body": "Money for Canadian services? We're broke. Money for liberal supporting corporations? Money printer go brrrrr\n\n\nLiberal government has fleeced all Canadians. Voting them in was like giving a No-Limit Credit Card to a teenager"
            },
            {
               "Body": "We have two choices;\nA) The federal government tightens it's belt and is more careful with its money in the future.\nB) raise taxes.\n\n\n\nLol... Just kidding... They're going to raise taxes."
            },
            {
               "Body": "Some one should cancel the federal government's Disney+ subscription."
            },
            {
               "Body": "And we all know that \"you won't have anything to give\" for veterans and other groups we have actual obligations through, while they piss away money on their friends and vanity projects."
            },
            {
               "Body": "If only we could reclaim some of the wasted spendings over the past 2 years."
            },
            {
               "Body": "Could leave firearms owners alone. Prob find 500 million plus."
            },
            {
               "Body": "Spending like drunken sailors and now the hangover begins."
            },
            {
               "Body": "Awe so what the government gonna have to make cutbacks maybe less funding on various programs? Well your gonna have to because the people of canada are financially tired and broke. Its time to work on behalf of Canadians instead of doing what you think is good for Canadians."
            },
            {
               "Body": "Lol I didn’t know Freeland was preforming at yuk yuks"
            },
            {
               "Body": "The CRA just said that it wasn’t worth chasing 30 billion in ineligible/fraudulent CERB and CEWS payments."
            },
            {
               "Body": "I thought the budget would balance itself if we spent whatever we wanted without thinking"
            },
            {
               "Body": "Maybe instead of sending $6 billion to Chrystia’s homeland of Ukraine they could have saved a few billion dollars so that Canadians could have access to a family doctor."
            },
            {
               "Body": "\"the budget will balance itself\" isn't the mantra anymore????"
            },
            {
               "Body": "Good thing her government wasn't spending us into a large deficit before COVID.  That would have been dumb."
            },
            {
               "Body": "What cancelling Disney plus didn’t help!?!??!"
            },
            {
               "Body": "I think we are all about to learn (again) that Freeland and Trudeau’s idea of “tight fiscal environment” is very different than most.\n\nThey are still going to have a massive deficit. They are still going to blow scads of money on consultants and pet projects and anything they think will buy them a vote come the next election. \n\nThe problem here is that if health care improves it will be the provinces who mostly get the credit, so why spend money on this when there’s some ginormous social project almost nobody wants or needs but will generate awesome sound bites waiting in the wings?"
            },
            {
               "Body": "So Ukraine spending is no concern but its tight when it comes to healthcare.  Really got their priorities straight over there."
            },
            {
               "Body": "To coin a phrase. We ask to much."
            },
            {
               "Body": "Is it so tight when they can spend $6 million to quarantine 15 travellers last year?"
            },
            {
               "Body": "Easy, rip up the tax havens agreements and implement a Tobin tax."
            },
            {
               "Body": "All MPs should give themselves budget cuts."
            },
            {
               "Body": "But that won’t stop them from spending."
            },
            {
               "Body": "What an absolute absurdity based on the history of this government."
            },
            {
               "Body": "* ...but they have the money to pursue a **pointless gun buy-back**?\n* ...and spend hundreds of millions on **consulting with McKinsey & Company**? \n* ...and send record amounts of foreign aid to **other countries**?\n\n* ...but nothing for **Canadians** who are being milked like cows to pay for the spending choices of the Federal Government."
            },
            {
               "Body": "We don’t need more taxes. We need fiscal decisions that prioritize the health and well being of Canadians so that we can continue to be a nation capable of helping others."
            },
            {
               "Body": "Oh, now they care about deficit spending. /s"
            },
            {
               "Body": "To me it seems like health, education, and infrastructure should be our major priorities, so in the face of a tight budget maybe tell some of the other shit to fuck off."
            },
            {
               "Body": "this is the most incompetent government in the history of Canada"
            },
            {
               "Body": "Stop giving things away to OTHER Countries when your own is in crisis..."
            },
            {
               "Body": "600 billion spent. not one new hospital built."
            },
            {
               "Body": "He will fund every other country but not canada. They are so corrupt"
            },
            {
               "Body": "We are on a tight fiscal.\n\nAlso, we are gonna pay billions to Ukraine and first nations."
            },
            {
               "Body": "She just took 2 billion and invested it in a non company but no money for h/c"
            },
            {
               "Body": "F**k that manipulative Rhodes scholar puppet master !"
            },
            {
               "Body": "Freeland is horrible"
            },
            {
               "Body": "Yeah, that’ll happen when a government spends money like drunken sailers in a nudie bar. The country is virtually bankrupt. There will be no room for new policy initiatives without substantial increases in taxes for at least a decade. The common notion of taxing big corporations or “the rich”? Sure, I’m all for it. That will solve a billion a year. Now time to find the next half trillion that Trudeau et al have already spent."
            },
            {
               "Body": "She needs to be fired and her assets frozen. Absolutely unqualified to be in her position."
            },
            {
               "Body": "Did the government cancel their Disney plus? Save 10’s of dollars there…you’re welcome."
            },
            {
               "Body": "They overspent on covid stimulus to the wrong people"
            },
            {
               "Body": "Like it or not, I think many of the unfunded benefits the government had created recently (child care, dental, etc) will probably need to be cut amongst many other services. I also never understood with the CCB why that wasn’t clawed back a bit with the child care deal."
            },
            {
               "Body": "They have more important things to spend money on, like a gun buyback program that'll cost in the hundreds of millions. Far more important than people's health care! We all know violence has totally stopped since the ban."
            },
            {
               "Body": "She wants to send billions more of our dollars to Ukraine in memory of her nazi collaborator grandfather"
            },
            {
               "Body": "It’s hilarious that so many people think printing the money is the solution. As if nobody ever thought of that. It gets tiring explaining to these people that it’s not some magical solution. we've had 3 years of people explaining the issue with it and still they haven't learned"
            },
            {
               "Body": "“Its too hard to account how much money we handed out to corporations”"
            },
            {
               "Body": "Spend billions on bullshit, have no money for essentials."
            },
            {
               "Body": "Simple solution is to cancel the Disney + subscription, right?"
            },
            {
               "Body": "Better give away more money to Ukraine"
            },
            {
               "Body": "If only her government has exercised some fiscal restrain in the good times."
            },
            {
               "Body": "Yet millions are going to private firms. 15billion the cra is writing off cause they are to lazy to go after. The money sent to Ukraine. \nYea ok the federal government talking about fiscal constraint. It’s a little late for that."
            },
            {
               "Body": "They can't spend when it matters most after nearly a decade of wasteful spending."
            },
            {
               "Body": "Why don't they just cut Disney?"
            },
            {
               "Body": "Just raise taxes on the middle class and make them pay more. \n\nThat's what the Liberals will do. Raise taxes and then spend it all on useless stuff. \n\nIt's time for a Conservative government to get us through these times."
            },
            {
               "Body": "Lmao Freeland has given/marked 1.5 billion to ukraine... But we are tight when coming to talks about Canadian health? PARDON?!"
            },
            {
               "Body": "And everyone at the Canadian public services is asking for a big pay raise…"
            },
            {
               "Body": "Liberals 2020: CERB relief\n\nLiberals: 2021 Hey we need to have an election.\n\nPeople:What we just had an election 2 years ago What for, how much is this gonna cost?\n\nLiberals: No worries just an easy few millions. Nothing big and well because um... reasons. (est cost 630million)\n\nLiberals 2022: Hey Ukraine heres some money! Also other people that dont need money or anything heres some for you.\n\nPeople: Yeah its nice to help others out.\n\nPeople 2022: Would be nice to get some better health care around here\n\nLiberals 2022: Puppetmokeylookingaway.meme\n\nLiberals 2023: So we looked at the money and well stuff is tight going into these talks you know we just cant print money or anything....\n\nPeople 2023: Angrysoccerfancrossarmed.meme"
            },
            {
               "Body": "Canadian dollar, banks, and real estate are going to zero"
            },
            {
               "Body": "Oh is that why Trudeau spent almost 7 million for 16 people to stay in Calgary?\n\nI guess with that kind of spending.."
            },
            {
               "Body": "Cut other expenses"
            },
            {
               "Body": "Why don’t record profits for companies lead to record levels of taxes?  \n\nLike I’ve always wondered this because as middle class the more I’ve made the more I have to pay. \n\nNo - I’m genuinely curious why we’ve created a system where companies can avoid taxes by filing in other jurisdictions. I think we are seeing that trickle down is pure BS as employees nowhere are sharing in these rewards. And if the money is going to shareholders in record profit years - then maybe we need to think really hard about how we tax capital gains. \n\nI think it’s high time investment institutions started grading a company on how they treat their employees and community. I mean it’s nice that they have a green plan and that you’ve factored it in to your assessment to make people feel good about investing in them - why not do the same thing for what really matters…..how they treat/reward employees and how much they give back to the communities they’re operating in."
            },
            {
               "Body": "Corporations keep posting record profits…maybe increase corporate tax rates?"
            },
            {
               "Body": "billions upon billions stolen and unaccounted for with your covid hoax plans"
            },
            {
               "Body": "I’m sure if we avoided using consultants we could have partially funded our healthcare"
            },
            {
               "Body": "Man /r/canada truly has been invaded by right wingers who have drunk the Kool aid.\n\nAll the talk about *worldwide* inflation being Trudeau's fault when *checks notes* Canada is running inflation at 6.3% which is below most other developed nations especially in the west. Meanwhile 12 years of conservative rule and policies have landed the UK at 10.5%"
            },
            {
               "Body": "The Ontario government has health dollars they haven’t used. The Ontario government forgave thousands of business loans that were fraudulent claims ( covid relief) The Ontario government spent millions on new license plates that peeled off and they have to replace for free.\nThat’s just one province, and 3 for instances\nI say there’s enough blame to go around."
            },
            {
               "Body": "Maybe we could afford healthcare if our system wasn't so overloaded with refugees. It isn't the 1800s we can't take refugees like we once did because now technology allows for moving more people we simply can't support that many financially as a country"
            },
            {
               "Body": "If I was handing money out for Healthcare, and it wasn't being spent on Healthcare by the Provinces. I would be saying the same thing."
            },
            {
               "Body": "This is funny comment coming from Federal Government"
            },
            {
               "Body": "Might be a hot take for this thread, but people seem to forget that the federal government gave billions to the provinces ear marked for healthcare/COVID relief.....and it disappeared. Looking at you Ontario (who is also sitting on a couple cool billion in surplus and letting it's healthcare networks burn).\n\nSomeone brought up the federal government increasing the federal debt by alot over the past couple years. I mean, I'm not an economist, but to keep people at home and trying to slow the spread of a disease that wreaked global havoc is gonna be expensive. Shoulda just shut everything down and not helped financially. That would've helped prevent a crash for sure. Everyone knows being proactive is cheaper than picking up the pieces right?\n\nAnd then people seem to forget that a few provinces requested/begged/demanded funds \"for healthcare\". When the federal government requested that it only be used for healthcare, and some data points related to healthcare, the provinces threw a tantrum. \n\nFood for thought, but why would the federal government increase CHT 10% when the provinces just totally refuse to fund it on their end, especially after a couple years of increase in emergency funding that wasn't used accordingly?\n\nI don't know why someone brought up the gun buyback. Doesn't seem pertinent to this conversation. But yes, gun bill is a flop."
            },
            {
               "Body": "Everywhere.  They are all the same. Our liberal states are a mess in crime and everything else. Conservative states are thriving. Hmm stealing money??"
            },
            {
               "Body": "Yeah. No shit. But you still always seem to manage to give billions to other countries. This broad is worse than Trudeau."
            },
            {
               "Body": "That’s what crazy looks like"
            },
            {
               "Body": "Jeez. A lot of posters here really don’t like Ukraine."
            },
            {
               "Body": "They are asking for more than we can afford to give…."
            },
            {
               "Body": "Oh, no! I wonder why"
            },
            {
               "Body": "Maybe the CRA should go look at those billions sent to corporations and fraudsters. We could put all that towards our healthcare system."
            },
            {
               "Body": "Did the Liberal government use up all the current health-care budget, but make extreme payments toward Indigenous Restitution?  \n\n\n\"We can't pay for the living. We used all the money on the dead.\""
            },
            {
               "Body": "Funny how we're tight for healthcare, but we're not concerned with clawing back billions in misused/fraudulent corporate COVID wage subsidies."
            },
            {
               "Body": "So now she has figured that out. Get rid of these fiscally irresponsible buffoons"
            },
            {
               "Body": "No shit Libs.  Can’t keep printing cash and giving it away.  No thought for fiscal policy.. can’t believe people vote for this garbage then whine about it"
            },
            {
               "Body": "If you think the government can't afford to do anything the Canadian people could produce then you have the neoliberal brain worm. They are lying."
            },
            {
               "Body": "Pure incompetence and negligence… their stupid imitation policy drove inflation through the roof"
            },
            {
               "Body": "I canceled Disney + I’m good more money than I have ever had"
            },
            {
               "Body": "So they've pissed away money for all the ridiculous reasons they could come up with over the last 7 years, and now there's nothing left for regular Canadians.  I hope we all remember how they prioritize next election."
            },
            {
               "Body": "So stop wasting money on ministers of inclusion and other fluff positions for hundreds of thousands of dollars per year."
            },
            {
               "Body": "So the Liberals had money $500 billion (racked up more debt per GDP than any other country on earth)for every little thing over the last 5 years but now there is nothing for healthcare. Interesting!"
            },
            {
               "Body": "Yet she wants 2 billion with no questions asked about it."
            },
            {
               "Body": "So after printing trillions of dollars for random shit for 3 years, now when we actually have an important spending priority, we're in fiscal trouble? Surprise pikachu"
            },
            {
               "Body": "Chrystia Freeland provides some ironic levity either without a shred of self awareness or in a crass disregard for the intelligence of the audience. You fecking hypocrite, you should have been in a tight fiscal environment from day one of your job."
            },
            {
               "Body": "She already pocketed 2B by funding a no name company lmao, why is she worried , it us who need to be worried"
            },
            {
               "Body": "But she had $2 billion to give to a fake company and got caught. Why isn't she in jail? Government embezzlement must be legal."
            },
            {
               "Body": "We didn’t give enough to Ukraine and every other country instead of taking care of Canadians to begin with"
            },
            {
               "Body": "Just send another 18 millions $ to Haiti and 40 million $ to Ukraine, we will be fine."
            },
            {
               "Body": "So stop wasting money on a bunch of garbage and make sure the current systems are working properly."
            },
            {
               "Body": "Interesting she was able to get $2,000,000,000.00 without explanation or oversight…\n\nMaybe it’s not as tight a fiscal environment if you’re a Liberal…"
            },
            {
               "Body": "Its amazing that we initially began the pandemic acknowledging our health system was inadequete and somehow with all the money spent how little actually made it to where it matters."
            },
            {
               "Body": "Don't worry, according the NDP and LPC the overspending is entirely the conservatives fault.  And when the conservatives start fixing the mess forced upon them, they'll be the bad guys.  The NDP and LPC can go fuck themselves."
            },
            {
               "Body": "I've been spending money that I don't have for years, and now I'm broke. You gotta help me. I've tried nothing and I'm all outta ideas"
            },
            {
               "Body": "And the rumor is that they want Freeland to be the next prime minister.\n Lol she doesn't have a clue and can't keep her mouth shut. Like many she should cancel some streaming channels."
            },
            {
               "Body": "Instead of just talking and spending a lot of our money with those meetings they should start doing something about those issues like health care and inflation. Talk-action=0."
            },
            {
               "Body": "\"We don't have money for health care, but do have money for new F-35s that cost four times as much as SAAB Gripens.\""
            },
            {
               "Body": "It's flat out depressing people still support this party."
            },
            {
               "Body": "So we can spend billions to Ukraine but not fund our own healthcare?"
            },
            {
               "Body": "I thought the budget would balance itself?"
            },
            {
               "Body": "Wait, Didn’t the dear leader only a few years ago laugh and say how cheap money was? Still waiting for that budget to balance it self. Good job y’all who voted for this."
            },
            {
               "Body": "A couple point rise in the GST?HST will take care of the health care fiasco. Consumption taxes are the way to go."
            },
            {
               "Body": "Keep yers powder dry!  \n\nCould be the best opportunity in a long while to scoop up cheap, under-valued real estate."
            },
            {
               "Body": "Not Canada specific, but a 2 minute reminder of just how bad interest payments on debt can impact future federal spending.  \n\nSpoiler: interest payments on the debt will surpass all US federal health care spending by 2027.\n\n https://youtu.be/IMeuzvzToPQ"
            },
            {
               "Body": "We're always in a tight fiscal environment when it comes to health care, aren't we?..."
            },
            {
               "Body": "Yeah well who put them there, bitch?"
            },
            {
               "Body": "Oh, is inflation cutting into your grocery bill too Freeland?"
            },
            {
               "Body": "i thought of i cancelled my disney subscriptions the budget would balance itself"
            },
            {
               "Body": "Only 69 billion in interest payments on the 2.1 TRILLION DOLLAR NATIONAL DEBT....that didn't even pay down the principal.    So yeah."
            },
            {
               "Body": "But somehow they thought they had billions of dollars to buy back guns from legal gun owners, knowing full well that legal guns are almost never used in a real crime… how stupid is this government?"
            },
            {
               "Body": "What a joke- who could have predicted “unprecedented” spending would result in no money. Can’t wait until high interest rates hit federal debt."
            },
            {
               "Body": "Reminds me of the episode of the Simpsons with the Cat Burglar. Homer and the group are stuck in the hole and homer yells out \"we'll dig our way out.\" Freeland is the one telling Trudeau \"no dig up stupid\""
            },
            {
               "Body": "Oh yea and hired another 100000 civil servants on top of all the othe idiotcy they have done over the last 7 years"
            },
            {
               "Body": "Funny that everyone in here seems to think running a government budget is the same as running a household budget and calls for austerity...\n\nI'm sure that has nothing to do with their political leanings..."
            },
            {
               "Body": "It’s okay, Canadians will cancel their Disney+ and Freeland will print some more money. The budget will balance itself"
            },
            {
               "Body": "Rationing it even more"
            },
            {
               "Body": "So long as this government is handing out billions in aid to countries in Africa and Asia then we have money we can give to the provinces for health care. Stop sending money to countries in Asia and Africa. We need it at home for Canadians. \n\nIf the feds come to the table and say there is no money, then that will seal the fate on privatization. Even if the Feds try and take provinces to court over it, Provinces will have a pretty solid defence. They asked the Federal government, which administers the Canada Health Act for more money to help the public system and they were given none. So they had no choice but to find another way.\n\nThis government has blown tens of billions on stuff that has not help the majority of Canadians. To say there is no money is a slap in the face to every Canadian."
            },
            {
               "Body": "they spent money on so many stupid things and now they're crying. what a trash government. incompetence!"
            },
            {
               "Body": "LPC is done lmao, crying poor now after years of printing billions? Actually go fuck yourself."
            },
            {
               "Body": "You’ll have to forgive Trudeau. He is self admittedly “disnumeric” and has trouble with numbers. Which isn’t the best trait for someone controlling the countries purse strings."
            },
            {
               "Body": "Mmmm.....let's see. They just gave 2 billion to first Nations as a settlement for the residential school issue. They cut a check to every Canadian that pays rent just a short while ago as part of a misguided economic relief package effort. How many millions are they spending on the Ukrainian war by sending them money and munitions. They're funding a child Care program that is very poorly timed economically, plus a dental health Care program.... The list goes on and on..... But now they are crying the pot is empty lol."
            },
            {
               "Body": "whaaaaaaaaaat? Did the printer run out of ink? Just brrrrrr some more."
            },
            {
               "Body": "Whatever liberals will do, people will be angry at them here, people here don't want to fix problems they just want conservatives to be in power, for their own wealthy pockets. Don't get me wrong, the liberals are not perfect but certainly too much criticism here willfully lacks of context for political points."
            },
            {
               "Body": "Oh so after dishing out millions to the rest of the world when it comes to healthcare funding they tighten up. Interesting."
            },
            {
               "Body": "then don't buy high end shit for other country's. when we don't even have the stuff you buy."
            },
            {
               "Body": "Weird they had billions ready to go to buyback firearms from legal owners for political points but now when it's something challenging like addressing healthcare they have to reign in spending."
            },
            {
               "Body": "Yup, when its time to throw money away or giving away to other countries, the federal government has bottomless bank accounts but when it comes to Canadians health care need, those that pay taxes and fund their bottomless bank accounts…. “we’re tight, really tight right now”"
            },
            {
               "Body": "What a shame. It was so easy for them to give billions of dollars of our money away to other countries. I guess Canada comes dead last with this government."
            },
            {
               "Body": "Tight Fiscal environment?...  These clowns spent all of the OUR money years ago,  we have been on a massive money printing binge for quite some time.  And our children will still be paying for the damage this government has done to this country.  Some on you!..  I have nothing else but contempt for these people,  this isn't a liberal / conservative thing either Jean cretien was a great leader.  This is solely about this one particular group of idiots..."
            },
            {
               "Body": "Wow with all the inflation and gas prices I bet they've seen more tax money that in any other year, where tf is it going?"
            },
            {
               "Body": "and in this environment we will bring in one million residents every two years but leave the creaking infrastructure and health sector with no extra funding! Seems like a great plan."
            },
            {
               "Body": "I'm still waiting for the Liberals to balance the budget as they promised back in 2017. Yet every single year under them has been fiscally negative, even while the economy was doing well pre-Covid. I loathe governments who think they can just rack up a bunch of debt that future generations need to deal with just to fulfill their unrealistic campaign promises."
            },
            {
               "Body": "More like Brokeland"
            },
            {
               "Body": "Imagine if they spent part of that half trillion on improving healthcare over the last 3 years instead of giving it to their donors?"
            },
            {
               "Body": "Dumb excuses. We are lead by narcissist sociopaths."
            },
            {
               "Body": "People keep pointing to the cerb spending as something essential, I was happy to get it but in all honesty we should have never locked down , prior to covid the playbook for pandemics were to only Isolate and vaccinate vulnerable populations, they threw that plan right out the window and locked everyone down and everyone had to be vaccinated and everyone still caught covid regardless of vaccine status or how hard we masked and locked down because they treated the idea of gaining immunity by letting our existing immune systems be exposed to a infection that has an almost 100% survival rate as blasphemy.  \n\nThe lock downs caused tons of mental health issues and alot of suicide, Ill be honest that was one of the toughest things I went through mentally and I became dependent on alcohol and weed throughout it I put on 40 pounds I've since lost and it has taken me some time to get back to normal but I'm getting there . The worst part was you couldn't even question any of this without being labeled a far right extremist they threw every label they could at anyone who had an independent thought which definitely didn't help peoples mental health either , I know it didn't help mine ."
            },
            {
               "Body": "That they created..."
            },
            {
               "Body": "How much have we sent to Ukraine? How much did we over pay for the McKinsey contracts?….."
            },
            {
               "Body": "Oh oh, the collection agents must have started calling. They have been spending like a teenager with their parent’s credit card, but when it’s something that matters like healthcare, all of a sudden they need to be fiscally responsible."
            },
            {
               "Body": "Oh so now they're thinking of monetary policy"
            },
            {
               "Body": "Translation: Get ready plebs, you gonna get poorer but the 1% will get richer every minute that passes."
            },
            {
               "Body": "Your owners aren't paying taxes?"
            },
            {
               "Body": "If they cut nurse and doctor funding i swear we'll see thousands move to the states.\n\nGood luck getting a doctor then lol"
            },
            {
               "Body": "Does she have original thoughts or does she just parrot what her WEF handlers tell her?"
            },
            {
               "Body": "Empires have no clothes on.."
            },
            {
               "Body": "No shit…"
            },
            {
               "Body": "It wasn't when Trudeau gave 1 billion to his own family via a fake organization"
            },
            {
               "Body": "Good. In Ontario at least the Feds already gave the province a bunch of money which they just sat on and never spent on healthcare.\n\nThough I wish that our Liberal/Conservative overlods would show this restraint more often. Our debt situation I'm pretty sure is worse now than in the 90s when they had to implement the sales tax and I see no way out of this long-term debt cycle unless we change our entire monetary system."
            },
            {
               "Body": "When will the libs stop flushing money down the toilet on Alberta Covid hotels?!?!?"
            },
            {
               "Body": "This is a clever ploy when dealing with conservatives premiers tbh. The more they ask, the more strings and they have to justify why they need more..also, with Polievre shifting the CPC much further to the right to defend against the PPC he’s left the centre votes up for Trudeau so all Trudeau has to do is nudge right a bit to slice off just enough votes to keep the CPC in 2nd place"
            },
            {
               "Body": "Neoliberalism kicking us in the collective sack"
            },
            {
               "Body": "So in short, no more money to give?? Bro let's just print another 400B because arrcording to the Justin Trudeau stans, printing money has no effect on the economy, and that he just a really good PM"
            },
            {
               "Body": "Freeland is an excellent finance minister that has figured out how to save out healthcare system tons of money by letting people drop dead waiting for care in emergency.  It's win-win!  /s"
            }
         ]
      },
      {
         "Title": "Margaret Atwood on Bill-C11 and why bureaucrats shouldn’t tell authors what to write",
         "Body": "",
         "Id": "10tlk9z",
         "Comments": [
            {
               "Body": "> The Emmy Award-winning TV adaptation of Ms. Atwood’s novel, The Handmaid’s Tale, failed to qualify as Canadian content as it doesn’t tick enough of the official boxes.\n\nDisgraceful."
            },
            {
               "Body": "Gettim Margaret!"
            },
            {
               "Body": "Finally Margaret and I agree on something. Margaret for Stampede parade marshall."
            },
            {
               "Body": "Why do Canadians allow their government to dictate what you can watch?  This seems insane to me."
            },
            {
               "Body": "She's one of the finest goalies this country has ever produced."
            },
            {
               "Body": "Paywall 😐"
            },
            {
               "Body": "More money should be put into small grants for Canadians making original content and building companies. \n\nPeople shouldn't be forced to consume Canadian content however. If the material or product is not desirable on its own merit the government shouldn't force it down people's throats."
            },
            {
               "Body": "Possibly unpopular opinion follows: The first Cancon law was passed back in the early 70's resulting in lots of air play for Canadian bands that weren't good enough to play a high school dance. Let's face it, if you're going to get played regardless of quality there is little incentive to work hard to put out a good product. To this day, many Canadian bands are mediocre at best but radio stations are forced to play them."
            },
            {
               "Body": ">The author said she had not read the bill “thoroughly yet”\n\nPerfect. Yet more commentary by people who have not read the bill.\n\nI don’t care how famous your name is or how laudable your other actions are statements are. If you haven’t read the bill, and you know that your name has weight that may sway others, then you have a responsibility to use that weight thoughtfully and shouldn’t be attaching your name to criticism of something you have not actually properly considered first.\n\n>\\[Atwood said\\] there seemed to be “well-meaning attempts to achieve some sort of fairness in the marketplace.”\n\nYes. So, once she actually reads the bill, she will indeed find that that’s the case.\n\nMeanwhile, the [Coalition for the Diversity of Cultural Expressions](https://cdec-cdce.org/en/), which counts dozens of cultural groups as members, representing thousands of Canadian writers, actors, directors, musicians, and other creators, supports C-11. And they *have* “read the bill thoroughly”."
            },
            {
               "Body": "And she shouldn't tell others what to build on their land: https://www.bloomberg.com/news/articles/2017-09-05/why-is-margaret-atwood-arguing-about-housing-on-twitter"
            },
            {
               "Body": "Atwood's a lazy writer, but she's correct on this."
            },
            {
               "Body": "Some idiot told me Turning Red should count as Can Con because it's set in T.O."
            },
            {
               "Body": "Too late"
            },
            {
               "Body": "Pretty basic. Gonna go with much wiser Marge here than pea brain in Ottawa here."
            },
            {
               "Body": "Only relevant part of that article is the last paragraph"
            },
            {
               "Body": "The wise human steel wool head speaks again."
            },
            {
               "Body": "Ignore the fact that it’s published in the Post, this is an excellent speech on the topic by Senator David Richards:\n\nhttps://nationalpost.com/opinion/sen-david-richards-liberals-bill-c-11-is-censorship-passing-as-national-inclusion/wcm/d6fc0916-ae11-4f3f-bae6-04745a40d67f/amp/"
            },
            {
               "Body": "Man, another thread where all the arguments are \"the government is telling you what you're allowed to watch!!!1\".?\n\nDoes anyone actually have a compelling argument against C11, or is it all just weird misunderstandings of what it actually does, and bad 1984 references?"
            }
         ]
      },
      {
         "Title": "Price for dairy products rising for third time in a year",
         "Body": "",
         "Id": "10tg6hi",
         "Comments": [
            {
               "Body": "Seems like it's getting cheaper to buy a milk cow.."
            },
            {
               "Body": "I stopped buying milk/cream/yogurt this past year. I used to eat a lot of Greek yogurt. I now only buy limited quantities of butter and cheese, and dropped the cheese the past few weeks. \n\nThe dairy industry might discover that once people stop buying dairy, they might never start buying it again."
            },
            {
               "Body": "Canadian milk mafia at it again"
            },
            {
               "Body": "Canada is just a collection of cartels taking turns robbing Canadians while governments fuck around and do nothing."
            },
            {
               "Body": "People say grocery stores inflate prices but in this case they are not even pretending that isn't true. It's systemic price controls."
            },
            {
               "Body": "The industry operates on a supply management system. **The Canadian Dairy Commission overseas**, approves, and sets the price farmers can charge for their dairy products. In November, the commission approved an increase of 2.2 per cent for the price farmer's charge, starting on Feb. 1.\n\nFuck I hope overseas is a typo... \"what's that China? Fuck with our citizens some more? Okay cranking up dairy prices\""
            },
            {
               "Body": "The greed is disgusting , recently saw a video where a farmer had to throw 30,000 liters of precious milk because of some stupid regulation. I hate this world to core sometimes."
            },
            {
               "Body": "BULLSHIT. Mandatory milk dumping to keep prices artificially high... [https://nationalpost.com/opinion/ontario-dairy-farmer-decries-mandatory-milk-dumping](https://nationalpost.com/opinion/ontario-dairy-farmer-decries-mandatory-milk-dumping) \n\n&#x200B;\n\nFucking mafia. switch to non-dairy milks for a while and let them burn."
            },
            {
               "Body": "Hopefully people stop buying. I haven't bought dairy in almost 3 years besides butter when it's on sale."
            },
            {
               "Body": "Meanwhile there was another article about a dairy farmer who had to dump 30,000L of milk to keep prices elevated.\n\nIt’s about time we open up our dairy market to the US and allow for some real competition"
            },
            {
               "Body": "Yet farmers are to dump up to 30k L of milk per month."
            },
            {
               "Body": "Haven't bought milk in years."
            },
            {
               "Body": "[deleted]"
            },
            {
               "Body": "https://www.reddit.com/r/ontario/comments/10t5lwb/i\\_dumped\\_30k\\_litres\\_canadian\\_farmer\\_shows\\_how/ \n\nYup.\n\nThe all powerful and benign \"market forces\".\n\nA totally dictatorial bullshit economic system."
            },
            {
               "Body": "Dismantle supply management now and forever."
            },
            {
               "Body": "Can't afford half and half coffee cream anymore. It's too expensive."
            },
            {
               "Body": "Damm !! Those cows must have negotiated a massive pay rise forcing the honest and well meaning captains of the dairy industry to increase the costs for the consumer.  /s"
            },
            {
               "Body": "Numero uno Cartel in Canada! Taxpayer enforced,profits guaranteed\n\nAin't no job like it!"
            },
            {
               "Body": "Dairy cartels are winning"
            },
            {
               "Body": "Years ago an ex of mine decided they wanted to try almond milk instead of dairy because you could buy unsweetened almond milk and add sweetener to taste, they were aggressively cutting sugar out of their diet. \n\nI haven’t bought dairy milk since that experiment of theirs. I fell in love with the variety, taste and price of the plant based alternatives. I honestly don’t think I will ever drink dairy milk again."
            },
            {
               "Body": "Well yeah, someone has to cover the cost of the milk that gets dumped to keep the supply low and justify increases, and it won't be the guys dumping the milk."
            },
            {
               "Body": "Saw another video of another dairy farmer today denouncing the whistleblower guy about how \"*civilians don't understand supply management*\" then tells him to \"Get rid of cows\" and \"If he doesn't like the Canadian supply chain system then go back to Europe where you came from\"  \n\n\nI might not fully understand but why on EARTH would anyone throw away money like this?  \n\n\nsee the video [here](https://www.tiktok.com/@phanson1983/video/7195793219576155398?is_from_webapp=1&sender_device=pc&web_id=7196333877533885957)"
            },
            {
               "Body": "Ive switched to Oat Milk. Its basically the same price now, and shelf stable."
            },
            {
               "Body": "“Milk down the drain to meet quotas”"
            },
            {
               "Body": "Didn't I read about milk being dumped to keep prices high? Fucking hell"
            },
            {
               "Body": "Meanwhile they’re still dumping milk daily. Fucking crooked system"
            },
            {
               "Body": "Fuck supply management"
            },
            {
               "Body": "Why are they not just raising milk quotas. Milk literally gets dumped out because dairy farms produce more than their quota. Its bullshit."
            },
            {
               "Body": "Meanwhile... \n\n\"\"I dumped 30K litres\": Canadian farmer shows how much milk is wasted to keep prices up\"\n\nhttps://dailyhive.com/vancouver/milk-prices-dairy-laws-canada-food-waste"
            },
            {
               "Body": "Stop subsidies and then let in American milk."
            },
            {
               "Body": "Dairy no good for you anyway. Sobeys got large cartoon almond milk for 2.99"
            },
            {
               "Body": "Thanks Trudeau!\n\nEdit: You're overthinking it. Justin Trudeau doubled our money supply and our dollars buying power is shrinking because of it, hence the need for price hikes.\n\nEdit: [Sort this by 5 years](https://tradingeconomics.com/canada/money-supply-m0)"
            },
            {
               "Body": "Hey, maybe we should get rid of CO2 TAX so we are not having to deal with shit like this. We are not saving the world by destroying ourselves!"
            },
            {
               "Body": "Supply chain management is broken on Canada"
            },
            {
               "Body": "Fascinating, there was an article just two days ago by a farmer complaining about having to dump tons of milk down the drain. Quite the dairy cartel we have here in Canada. \n\nhttps://nationalpost.com/opinion/ontario-dairy-farmer-decries-mandatory-milk-dumping/"
            },
            {
               "Body": "The criminal supply management racket needs to be shredded yesterday. It's not protecting small family farms. It's enriching mob connected conglomerates https://www.cbc.ca/news/canada/montreal/quebec-dairy-mogul-lino-saputo-had-secret-past-dealings-with-u-s-mobster-joe-bonanno-then-lied-about-it-1.5428629"
            },
            {
               "Body": "Finally some good news 😌"
            },
            {
               "Body": "I guess I'm switching back to Margarine 🤷‍♀️"
            },
            {
               "Body": "Oh look, another thread of people complaining that the price of milk is *finally* rising due to inflation.\n\nNo mention that the price is still under inflation over the last 10 years though"
            },
            {
               "Body": "Call me crazy and I’m sure there are reasons it wouldn’t work I’m unaware of, but I propose a federal processor be set up for processing quota surplus. Any surplus will be accepted and processed into long lasting preservable and shelf stable items such as hard cheese and processed cheese. In times of plenty instead of sending cash as foreign aid we send our cheese and help feed the needy. This would apply domestically as well, those under a certain income bracket could collect cheese, powdered milk and butter as a social benefit combating domestic hunger. Then during times of scarcity those products could be brought into the standard market to balance it out and prevent prices from rising is much (like 3 times a year). Instead of paying for the over production, the contributing farmers would get a tax credit of some kind and because we use that for foreign aid, we have more money in our pockets domestically.  My proposal is very similar to the US Government cheese program, without as much warehoused surplus by substituting the processed milk products where cash would generally be used in international aid situations. People could be using the milk instead of it being dumped and there would be no reason for 3 hikes a year."
            },
            {
               "Body": "I havent bought yogurt or cheese for a while. Only milk for my coffee and even then I am considering alternative.\n\nScrew that racket.\n\nAlso diary aren't really that good for us more than anything else. \n\nIts a scam."
            },
            {
               "Body": "Time to buy a gallon of milk and water it down to make 2 gallons out of one!"
            },
            {
               "Body": "The dairy cartel said it was in our interests to raise prices."
            },
            {
               "Body": "Wasn’t there a video of milk being poured out to keep prices high?"
            },
            {
               "Body": "And those greedy fucking farmers are still feeding cows palm oil to boost the fat."
            },
            {
               "Body": "Well how else are they going to pay MLSE the billions they owe them, can’t buy a leafs jersey anymore without the word ‘Milk’ on it"
            },
            {
               "Body": "No name evaporated milk was $1.29 a can last week. Now its $1.79! What the fuck.."
            },
            {
               "Body": "Yet nobody votes PPC.\n\nYou get what you vote for"
            },
            {
               "Body": "UDDERLY ATROCIOUS, Dairy quotas and protectionism has been in Canada  for over 50years under both the Libs and the Cons. The Canadian Dairy Commission (CDC) the Milk Mafia wont allow competition especially from USA.\n\nCDC says if competition is allowed , dairy prices will drop, BUT then the small family dairy farm will suffer and go bankrupt. So CDC keeps the price of Canadian dairy artificially high.\n\n[https://nationalpost.com/opinion/ontario-dairy-farmer-decries-mandatory-milk-dumping](https://nationalpost.com/opinion/ontario-dairy-farmer-decries-mandatory-milk-dumping)"
            },
            {
               "Body": "Maybe get rid of quota rules so the extra doesn't her wasted !"
            },
            {
               "Body": "Inflation is a thing.\n\nWe get it.\n\nTalk about something like African emigration or Kiwi flooding."
            },
            {
               "Body": "lactose intolerance is paying off, i see."
            },
            {
               "Body": "Great timing right after government made a dairy farm dump 30,000 litres because he was over the quota. Even offered to donate it to shelters. Government for the L"
            },
            {
               "Body": "Oat milk. Almond milk. Coconut milk."
            },
            {
               "Body": "It's nice to have lots of friends in government."
            },
            {
               "Body": "and here they tell us there is \"disinflation\" LMFAO what a joke"
            },
            {
               "Body": "A southwestern Ontario farm just had to dump 30k litres of milk because, quota."
            },
            {
               "Body": "Fuck. They just aint gonna stop are they"
            },
            {
               "Body": "good. we never needed it, now maybe people will wake up to that."
            },
            {
               "Body": "Don't blame the farmers for this. They're getting absolutely fucked by the big corporations."
            },
            {
               "Body": "We lobby government to print more money to pay for it."
            },
            {
               "Body": "They should remove that supply and demand scheme"
            },
            {
               "Body": "Fuck every milk farmer. Bunch of criminals. Bring in American milk. Fuck buying Canadian."
            }
         ]
      },
      {
         "Title": "Financial advisors recommend buying grocery stock instead of groceries",
         "Body": "",
         "Id": "10tlbl6",
         "Comments": [
            {
               "Body": "While satire posts are popular we understand that not everyone enjoys them. If you wish not to see them please use the filter on the sidebar or set your own filters to block satire content or websites.\n\nLa satire est populaire ici, mais nous comprenons que tout le monde ne l'apprécie pas. Si vous ne souhaitez pas les voir, veuillez utiliser le filtre sur la barre latérale ou définir vos propres filtres pour bloquer le contenu satirique ou les sites Web.\n\nFilter out Satire - Filtrer Satire: https://st.reddit.com/r/canada\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*"
            },
            {
               "Body": "Anyone got a recipe for all these stocks?"
            },
            {
               "Body": "Can I.... Can I eat these stocks??"
            },
            {
               "Body": "They're not wrong"
            },
            {
               "Body": "Just a regular reminder that corporations aren't your friends. Corporate greed isn't causing inflation. Corporations have always been greedy assholes. Be as mad at Loblaws as you like, they're still going to set prices to extract as much money as possible."
            },
            {
               "Body": "Well, your stock purchases might go to shit. Pretty much a guarantee for groceries."
            },
            {
               "Body": "Loblaws stock ran up 100% in two years, i wouldnt be buying here."
            },
            {
               "Body": "Buying consumables are always bad. Buying profitable are always good. If you only want money, not to stay alive."
            }
         ]
      },
      {
         "Title": "A GTA man took just an hour to find his dad's stolen car. But police say it wasn't a great idea",
         "Body": "",
         "Id": "10tonia",
         "Comments": [
            {
               "Body": "\"Uhm sir, please don't do our job for us, it makes us look bad. We'll be there in a few hours....maybe\""
            },
            {
               "Body": "> Residents should call 911 immediately and 'not put themselves at risk,' police say\n\n>…\n\n>Rami Temani says he immediately called police. But [was] told it would take several hours for officers to arrive…"
            },
            {
               "Body": "If the cops are so upset at people not allowing themselves to be victimized, perhaps they should consider doing their fucking jobs so the Average Joe doesn't have to do it for them?"
            },
            {
               "Body": "Of course the police are mad, the guy actually got his car back rather than letting it be sold out of Montreal to some 3rd world country. \n\nI fully expect to see more of this as time goes on. The police and courts in this country have completely abdicated their responsibilities so this is the only recourse us regular citizens have"
            },
            {
               "Body": "Imagine what resources come into play if the stolen vehicle belong to a cop?"
            },
            {
               "Body": "Crime in progress and they won't move. I agree it's not a good idea to chase down the thief yourself but I'm not surprised it happens. And look, it actually got results."
            },
            {
               "Body": ">But police say it wasn't a great idea\n\nSure.\n\nFar better to contact them so they can tell you how they're far, far too busy to possibly look into a single stolen vehicle. \n\nWhich may actually be true. But it doesn't change the fact that it's not a good idea to depend on police to find stolen anything."
            },
            {
               "Body": "I think this is going to be a trend as time goes on. Police are not helping anymore. They have actually harmed their reputation and trust among the general population. Along with the courts failing to keep us safe when the police do manage to catch someone it is not surprising to see people going outside of the traditional \"justice\" system.\n\nOf course I would never recommend confronting a criminal yourself and you have no clue how that person or persons is going to react, what illegal drugs they may be taking or what weapons they may have. \n\nAlso remember in Canada you are going to have a hell of a time claiming self defence especially if you harm a criminal that is stealing your property. Our laws regarding self defence are dog shit and hopefully a future government will actually give us the power to defend ourselves and our property without fear of jail time or spending tens of thousand on defence and years of sleepless nights."
            },
            {
               "Body": "Should send the cops a bill for his time and effort. What's the standard hourly base pay for a constable? Double it. What the fuck is the point of our taxes you useless bags of shit."
            },
            {
               "Body": "Property theft is not a big priority for police in general because of the often organized nature of the crimes or the low $ value (E: and their limited resources).  Now, if some big profile millionaire/billionaire had their super-car stolen, that would be different."
            },
            {
               "Body": "Cops would never say: *thanks for taking the law into your own hands good citizen!  Saves us time and paperwork and allows us to focus on other matters.*"
            },
            {
               "Body": "Who is in charge?\n\nChief Wiggum?"
            },
            {
               "Body": "I feel like 911 operators are very rude in general. I guess you only hear the calls that go bad so maybe a misrepresentation.. but it really bothers me when they give shitty advice and demand to stay on the phone and ask pointless questions during a .. let’s say home invasion or something \n\nClassic case of the boy stuck under the car and called and said he was dying. The operator didn’t Believe him and hung up"
            },
            {
               "Body": "Whaaaaaat? You mean the police are useless (unless you're rich)?\n\nBetter give them more money so they have the resources to not be so fucking useless."
            },
            {
               "Body": "They are too busy on their cell phones in the patrol car while they are supposed to be enforcing HWY traffic Act ! It’s so obvious !"
            },
            {
               "Body": "Lmao the cops tell us they can’t help us and also tell us not to help ourselves…. So they are telling us to just sit back and take it. What shitty people."
            },
            {
               "Body": "The same people crying about police response times are the ones calling for departments to be defunded. \n\nChange my mind"
            },
            {
               "Body": "This sub bootlicks cops whenever stuff like funding or police abuse comes up but get the pitchforks out when shown evidence that the police are useless"
            },
            {
               "Body": "Yo. Don't take away their job."
            },
            {
               "Body": "Reminds me of people who see their own stolen bikes for sale online, arrange to meet up and buy them, and then just ride off."
            },
            {
               "Body": "gta fans when"
            }
         ]
      },
      {
         "Title": "They paid top dollar for pre-construction homes at the market peak. Now their builder is selling the same models for far less.",
         "Body": "",
         "Id": "10thppb",
         "Comments": [
            {
               "Body": "\"I gambled and lost. Who will pay for my losses?!\""
            },
            {
               "Body": "U win some, u lose some"
            },
            {
               "Body": "Let’s start with some general observations, shall we? About 1 in 5 (21.0%) homes in the median city across the four regions are investor-owned. When isolating new construction (built after 2016), that number rises to 1 in 3 (33.7%) bought by investors. Their ownership of new housing is overrepresented. It’s running about 60% faster than the general market share.\n\nBoo fucking hoo"
            },
            {
               "Body": "They really picked some good rage bait for the Saturday edition, didn't they.\n\nThe main example is a Brampton lawyer who bought two houses at $2.46M each (for his family, naturally), that's unsure of who he blames more, the builder, the bank of Canada or Justin Trudeau.\n\nHe's considering walking away, but not sure if the builder will sue. Reminder, that this guy is a lawyer.\n\nI believe there are some people that got caught up in terrible timing that were just trying to get into the housing market. None of those people were building multi million dollar homes though."
            },
            {
               "Body": "How is this any different than the thousands of others who bought re-sale homes at inflated prices, only to see similar houses in the same neighbourhood now selling for much less? \n\nNon-story here. Move along."
            },
            {
               "Body": "Too bad. Everyone knew they were overpaying if they bought in the last 2 years. You treat a home as an investment, you have to take the risks of investors, which means losing sometimes."
            },
            {
               "Body": "What did we learn about FOMO? When prices run away from the long term trend line, they'll come down just as fast. Sorry about your luck, but if you bought BTC at $50k, I have no sympathy for you. Same goes for housing."
            },
            {
               "Body": ">“We are in the soup,” says Brampton lawyer Ajit Soroha, who, with his wife, purchased two homes for their family in Mattamy’s Preserve West development last February. The houses cost $2.46 million each and they have paid about $800,000 in deposits for the two.\n\n>Soroha said he doesn’t know who he blames more – the builder, the Bank of Canada that hiked its key lending rate eight times between March and January, or Prime Minister Justin Trudeau.\n\nJust...wow..."
            },
            {
               "Body": "Spin the wheel. Sucks, but risk is just part of life"
            },
            {
               "Body": "You pay your money  you take your chances. \n\nWhy is this news? Oh wait, it is the T Star and there is a victim story under every rock.."
            },
            {
               "Body": "Doesn't help when u plaster commercial advertising on the front of your house.  Sure the neighbors are happy with that. Also for these type of articles who gets in touch with who first? Did the lawyer call TS and say \"boy have i got a story to tell!\" Or \n.."
            },
            {
               "Body": "Let me pull out my tiny violin ….. you played the market and lost. It’s called risk."
            },
            {
               "Body": "Wow things that go up must come back down? I swear I've heard that saying before."
            },
            {
               "Body": "I feel sorry for him. A home with his law firm advertised, with two teslas, and god knows which cars are inside.\n\nMade a purchase of 5 million for two homes and paid a 800,000 deposit.\n\nFuck off already. Of course the Toronto Star feels bad for landlords."
            },
            {
               "Body": "Suck to be you!"
            },
            {
               "Body": "You won't find sympathy here. It's the way she goes. Sometimes she goes, sometimes she doesn't and she didn't go this time. Just the way she goes."
            },
            {
               "Body": "Lol get wrecked"
            },
            {
               "Body": "Bought at the peak thinking it was the dip?  Cue WSB \"one of us! One of us!\" Chants"
            },
            {
               "Body": "How many were bought as revenue property?"
            },
            {
               "Body": "🎻"
            },
            {
               "Body": "It sucked when developers were holding people hostage and terminating deals even they decided to charge people more for homes.\n\nBut in this case, these made a deal they budgeted for and are upset about the market. This is completely on them.\n\nIf they bought property and the value crashed, the solution would have been to be happy about owning and budgeting for a home. But investment owners can't think of it that way because they aren't building homes."
            },
            {
               "Body": "Oh boohoo, wannabe slumlord was snatching up homes trying to take advantage of the immigration plus housing boom and now that the market is on the decline, he's technically overpaying.\n\nCry me a river. I hope these people aren't seriously looking for sympathy"
            },
            {
               "Body": "> Soroha said he doesn’t know who he blames more – the builder, the Bank of Canada that hiked its key lending rate eight times between March and January, or Prime Minister Justin Trudeau.\n\nLet's crowdfund Ajit Soroha a mirror."
            },
            {
               "Body": "When you try to flex & the house of cards falls out from underneath you.\n\nFam is probably $6m in the hole while working a prestigious job that pays super well. It’s no one else’s fault he lacks common sense."
            },
            {
               "Body": "But muh investment?!"
            },
            {
               "Body": "Their problem"
            },
            {
               "Body": "Sounds like me investing in the stock market"
            },
            {
               "Body": "Don’t care. That’s the price you pay (literally) for playing the game."
            },
            {
               "Body": "People hoping to make a quick buck or FOMO get hard lesson in economics.  News at 11."
            },
            {
               "Body": "Sucks to suck."
            },
            {
               "Body": "The article is beyond ridiculous. You have a lawyer who doesn't understand what the word contract means, who calls himself a regular guy who's buying $2.3 million of pre-con properties and is basically asking to be bailed out. Unreal."
            },
            {
               "Body": "The funny part is his Tesla has also gone down substantially in price too"
            },
            {
               "Body": "Play stupid games, win stupid prizes."
            },
            {
               "Body": "In the long term it doesn't matter so much.  No one I'm sure is kicking themselves over buying a 350K house in 2008 when they could have paid 300K.  It's a rounding error in the grand scheme of things.\n\nNo one can time the market.  It trends up over the decades but fluctuates constantly."
            },
            {
               "Body": "Oh no, anyways......."
            },
            {
               "Body": "People got fucked same why by Tesla few months ago paid more than new ones sell for now. Buyer beware of price drops"
            },
            {
               "Body": "“And friends, this is why we need to develop the green belt.” \n\n-Doug Ford (probably)"
            },
            {
               "Body": "We're supposed to feel bad for them?"
            },
            {
               "Body": "They paid for top dollar pre-con houses and now they have paid the price for top dollar risk. Nothing new here."
            },
            {
               "Body": "Que the world's tinyest violin 🎻"
            },
            {
               "Body": "Boo fucking hoo! That’s the way she goes."
            },
            {
               "Body": "I really don't understand how people just don't really get capitalism. *The entire point is to rook people in at top dollar - in order maximize the profits.* No one has an issue with it - as long as they are in on the profits. \n\nAnd the RISK - so now that the bet that was made is NOT paying off - they want some sympathy FOR A CHOICE THEY OPENLY MADE THEMSELVES. It's called FREEDOM for a reason - you choose - and it's always win or lose."
            },
            {
               "Body": "Im ok to pay for his dip, if he pays me his gains throughout years"
            },
            {
               "Body": "Investments have risks - what a fool.  The Star must be starved for real stories."
            },
            {
               "Body": "[removed]"
            },
            {
               "Body": "Homes are like a stock. Just a safer investment."
            },
            {
               "Body": "Well... you play the game, you gotta expect to lose sometime."
            },
            {
               "Body": "Uh, so?\n\nBuyers coverted cash into a house.  \n\nThe value of the the house is 1 House.   Current position is even."
            },
            {
               "Body": "This shows how our free market economics is bullshit. Competition should keep the housing prices low. If you can drop your prices by hundredths of thousands of dollars then your competition should have taken market share from you long ago or new companies should have started and moved in."
            },
            {
               "Body": ">Soroha said he doesn’t know who he blames more – the builder, the Bank of Canada that hiked its key lending rate eight times between March and January, or Prime Minister Justin Trudeau.\n\nWhat the fuck - how about blaming yourself? BoC has to respond to inflation, just the our neighbours to the south. And I'm no fan but why is Trudeau to blame for everything? You could argue that the builders shouldn't be selling pre-construction at market prices since there is risk involved - they're greedy cunts no doubt - but ultimately you fell for it."
            },
            {
               "Body": "boo fucking hoo"
            },
            {
               "Body": "Good."
            },
            {
               "Body": "I mean, I'll probably never own a home now soo.\n\nSorry but, I'm not exactly gushing with sympathy."
            },
            {
               "Body": "While i feel for some people that have been affected by prices falling, my sympathies are limited.\n\nI have overpaid for many things in life, its the way it goes. What I buy today, could be worthless tomorrow. It could be worth more.\n\nBuying a house at the peak of the market comes with risks. Financing when interest rates are low makes sense, but you always need to factor that life changes, and often changes quickly and unexpectedly. Housing pricing dropping should not have been unexpected, Interest rates rising should not have been unexpected. Trusting the banks to look after you before their own interests is stupid. They are selling their services,  just like everyone else selling their services. It is up to the buyer to do their own due dilligence.\n\nFor some reason, too many people accept they should be shopping at the top of their capabilities. While there could be some validities to this approach, there are also drawbacks. This needs to be balanced, and the pros and cons need to be weighed, thought out and contingencies planned."
            },
            {
               "Body": "One time I bought a game right before the steam summer sale, any journalists wanna write about me"
            },
            {
               "Body": "Cry me a River Run Estates"
            },
            {
               "Body": "Wah wah"
            },
            {
               "Body": "If only we could have told you so. House Prices are just the price someone is willing to pay. No real reflection on cost and value. It’s BS."
            },
            {
               "Body": "Suckers."
            },
            {
               "Body": "\"Brampton lawyer Ajit Soroha, who, with his wife, purchased two homes for their family in Mattamy’s Preserve West development last February. The houses cost $2.46 million each and they have paid about $800,000 in deposits for the two.\"\n\nBought two houses \"for their family\".  Hahaha bullshit.  You were buying an income property (at least one of the two) and your investment went the other way.  \n\nThat's a risk anyone takes when making an investment."
            },
            {
               "Body": "\"Brampton lawyer Ajit Soroha, who, with his wife, purchased two homes for their family in Mattamy’s Preserve West development last February. The houses cost $2.46 million each and they have paid about $800,000 in deposits for the two.\"\n\nBought two houses \"for their family\".  Hahaha bullshit.  You were buying an income property (at least one of the two) and your investment went the other way.  \n\nThat's a risk anyone takes when making an investment."
            },
            {
               "Body": "If it's their first home, they should get the lower rate. If it's someone that owns a few, tough break."
            },
            {
               "Body": "Unrelated, but I have zero love for Mattamy homes. We were house shopping and Mattamy had just built their first show homes in Edmonton. We fell in love with one of their showhomes, the model in question was ~$450k depending on the lot.\n\nWhen we looked into building said model we found out the showhome had over $500k in \"upgrades\"\n\nWho the fuck builds a showhome that is double the price of the base model? Not a single other builder we looked at went even close to as overboard with upgrades"
            },
            {
               "Body": "While I don’t feel super bad for them I also see their point. Didn’t some builders asked for MORE from buyers than what they purchased it for during hot COVID market ?"
            }
         ]
      },
      {
         "Title": "Canada slaps new sanctions on Russia targeting ‘disinformation actors’",
         "Body": "",
         "Id": "10tlfma",
         "Comments": [
            {
               "Body": "Oh shit this sub is gonna slow right down"
            },
            {
               "Body": "\"We're not banning hunting rifles.\""
            },
            {
               "Body": "Canada should slaps sanctions on disinformation actor Tucker Carlson."
            },
            {
               "Body": "Canada should also slap sanctions on Trudeau for spreading disinformation about his now failed C-21 amendment"
            },
            {
               "Body": "Any evidence for those *'Russian disinformation actors'*, or is this just another feeling/propaganda angle?\n\nThere was a recent [twitter files release (#15)](https://threadreaderapp.com/thread/1619029772977455105), which is a great read, and relays that most of the legacy news's assertions of 'Russian bots' were based on claims from a *Hamilton 68 dashboard* which was run by the FBI at twitter.  The runners of which claimed specific accounts were 'bots', even though twitter itself later discovered were bogus claims after finding out what accounts they were talking of."
            },
            {
               "Body": "I have a few accounts from here on reddit, from around Half a year before the war started that definitely fit what this article is laying out. \n\nRussian accounts that I actually came into contact with on r/canada... it was to do with our politics."
            },
            {
               "Body": "Global news is hostile foreign propaganda."
            },
            {
               "Body": "Kick Russians ambassador Oleg the fuck out of if he is still here. \n\nTime for ambassadors with Russia has come and gone. They know the terms, leave Ukraine or suck it. \n\nHe can go join the front and become mulch"
            },
            {
               "Body": "\"Canada now banning Adidas track suits and borsh\""
            }
         ]
      },
      {
         "Title": "More than 25,000 Nova Scotia Power customers without power amid extreme cold",
         "Body": "",
         "Id": "10tinv3",
         "Comments": [
            {
               "Body": "This post appears to relate to a province/territory of Canada. As a reminder of the rules of this subreddit, we do not permit negative commentary about all residents of any province, city, or other geography - this is an example of prejudice, and prejudice is not permitted here. https://www.reddit.com/r/canada/wiki/rules \n\nCette soumission semble concerner une province ou un territoire du Canada. Selon les règles de ce sous-répertoire, nous n'autorisons pas les commentaires négatifs sur tous les résidents d'une province, d'une ville ou d'une autre région géographique; il s'agit d'un exemple de intolérance qui n'est pas autorisé ici. https://www.reddit.com/r/canada/wiki/regles\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*"
            },
            {
               "Body": "Definitely a rough time to lose power. Hopefully it doesn't last too long."
            },
            {
               "Body": "Just in time for that nice electricity hike AND I have no power! Double win win...atleast I'm saving on power today 🙄🙄"
            },
            {
               "Body": "Harsh. Stay safe everyone."
            },
            {
               "Body": "Totally worth a 14% rate increase!"
            },
            {
               "Body": "I always think it’s kinda funny that when blackouts happen you get the “Remember, your gas stove top is not a source of heat. Carbon monoxide is a silent killer” warnings.\n\nBut letting a soup simmer for 24 hours on a gas stove? That’s totally ok.\n\nJust make soup to keep the kitchen warm if you can I guess."
            },
            {
               "Body": "Time to take the power back! (literally)"
            },
            {
               "Body": "Apparently there are rolling blackouts in places, because of the grid is overloaded. I'm some glad I have a woodstove!"
            },
            {
               "Body": "This is exactly why people need woodstoves, and why people need to stand up to anyone trying to claim that woodstoves need to be banned."
            },
            {
               "Body": "time to remove mandatory electric heat backup requirements.\n\nwaste your money to have no less risk"
            },
            {
               "Body": "Global warming is killing us. \n\nThoughts and prayers for all of them"
            },
            {
               "Body": "Quick fire up the solar panels!!"
            }
         ]
      },
      {
         "Title": "Man charged with drugging, sexually assaulting 5 women had previous conviction",
         "Body": "",
         "Id": "10tfiy4",
         "Comments": [
            {
               "Body": "For the same fucking crime. We need to make sex offenders wear ankle tags if we let them out at all (and this guy should not have been out). Women shouldn't have to put up with known criminals raping them."
            },
            {
               "Body": "Shocking, he has priors."
            },
            {
               "Body": "Out on bail?"
            },
            {
               "Body": "He'll be sentenced to house arrest for 10 days. Our justice system is broken."
            },
            {
               "Body": "Chemical castration ought to do the trick."
            },
            {
               "Body": "Canada should have a proper sex offender registry for people like this with publicly available photos, general location, etc.\n\nAs technology like facial recognition improves it would also allow dating sites to actively screen for known offenders."
            },
            {
               "Body": "The conservatives are looking like a more logical option every. Single. Day."
            },
            {
               "Body": "The Canadian justice system is pathetic. It has been proven time and time again that rehabilitation does not work for sex offenders and goofs. \nStop letting them out. Stop letting them reoffend."
            },
            {
               "Body": "Porn and drugs don't turn a man into a rapist. He was probably born as a mutt."
            },
            {
               "Body": "Canada is becoming the butt of the joke…"
            },
            {
               "Body": "Good old Canadian Justice at it again!"
            },
            {
               "Body": "Remember to google your dates name ladies"
            },
            {
               "Body": "Of course he did. (How do I make an eye roll emoji?)"
            }
         ]
      }
   ]
}