{
  "NewsApi-Every Game Coming to PlayStation Plus and Xbox Game Pass in January 2023 (So Far)": {
    "type": "NewsApi",
    "title": "Every Game Coming to PlayStation Plus and Xbox Game Pass in January 2023 (So Far)",
    "body": "Happy new year! I hope you got a chance to catch up on your gaming backlog over the holidays, because 2023 is starting off strong with a litany of great games coming to PlayStation Plus and Xbox Game Pass in this month, including freebies you can download and…",
    "url": "https://lifehacker.com/every-game-coming-to-playstation-plus-and-xbox-game-pas-1849946592",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/81e8dfc48101ac53ffe05a4450430cf2.png",
    "hasImage": true,
    "comments": {
      "body": "Happy new year I hope you got a chance to catch up on your gaming backlog over the holidays because 2023 is starting off strong with a litany of great games coming to PlayStation Plus and Xbox Game Pass in this month including freebies you can download and"
    }
  },
  "NewsApi-James Cameron's Already Setting Avatar 3 on Fire": {
    "type": "NewsApi",
    "title": "James Cameron's Already Setting Avatar 3 on Fire",
    "body": "If you’re wondering what the future holds for the planet of Pandora after Avatar: The Way of Water, you likely won’t have to wait another 13 years for the sequel. Now that the Avatar sequel is about to cross the $2 billion mark, director James Cameron seems h…",
    "url": "https://gizmodo.com/avatar-3-way-of-water-sequel-fire-james-cameron-1849993680",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/d1ef6ab1f2b051e2949ea5e4837c2760.jpg",
    "hasImage": true,
    "comments": {
      "body": "If youre wondering what the future holds for the planet of Pandora after Avatar The Way of Water you likely wont have to wait another 13 years for the sequel Now that the Avatar sequel is about to cross the 2 billion mark director James Cameron seems h"
    }
  },
  "NewsApi-Raducanu happy injured ankle passed opening test at Melbourne ... - Reuters": {
    "type": "NewsApi",
    "title": "Raducanu happy injured ankle passed opening test at Melbourne ... - Reuters",
    "body": "Emma Raducanu was pleased with how her ankle held up in her first match since picking up an injury in the build-up to the Australian Open, saying that getting on court had eased any lingering worries she had.",
    "url": "https://www.reuters.com/lifestyle/sports/raducanu-happy-injured-ankle-passed-opening-test-melbourne-park-2023-01-16/",
    "urlImage": "https://www.reuters.com/resizer/JeASjd3yDaDcub3TZd6g0AE-2IM=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/PDYJLX64TJLKJOJIDEHEOUKRKE.jpg",
    "hasImage": true,
    "comments": {
      "body": "Emma Raducanu was pleased with how her ankle held up in her first match since picking up an injury in the buildup to the Australian Open saying that getting on court had eased any lingering worries she had"
    }
  },
  "NewsApi-Emotionally drained Djokovic savours happy end to difficult fortnight - Reuters": {
    "type": "NewsApi",
    "title": "Emotionally drained Djokovic savours happy end to difficult fortnight - Reuters",
    "body": "Novak Djokovic said shedding tears in his players' box following victory over Stefanos Tsitsipas in the Australian Open final on Sunday was the result of an emotional collapse following his huge display of mental strength in a challenging fortnight.",
    "url": "https://www.reuters.com/lifestyle/sports/emotionally-drained-djokovic-savours-happy-end-difficult-fortnight-2023-01-29/",
    "urlImage": "https://www.reuters.com/resizer/_QfBRoSIwrskV5u8u2ojn76jiLE=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/TIFBZAM6XFLYXOOY3EIJN7CF3U.jpg",
    "hasImage": true,
    "comments": {
      "body": "Novak Djokovic said shedding tears in his players box following victory over Stefanos Tsitsipas in the Australian Open final on Sunday was the result of an emotional collapse following his huge display of mental strength in a challenging fortnight"
    }
  },
  "NewsApi-Happy New Year, Hackaday!": {
    "type": "NewsApi",
    "title": "Happy New Year, Hackaday!",
    "body": "[Tom Nardi] and I were talking on the podcast about 2022, and how it went from the hacker’s perspective. As the global chip shortage entered its second full year, we both thought back on the ways t…",
    "url": "https://hackaday.com/2023/01/07/happy-new-year-hackaday/",
    "urlImage": "https://hackaday.com/wp-content/uploads/2023/01/2022review_feat.jpg",
    "hasImage": true,
    "comments": {
      "body": "Tom Nardi and I were talking on the podcast about 2022 and how it went from the hackers perspective As the global chip shortage entered its second full year we both thought back on the ways t"
    }
  },
  "NewsApi-'Redfall' brings open-world vampire hunting to Xbox and PC on May 2nd": {
    "type": "NewsApi",
    "title": "'Redfall' brings open-world vampire hunting to Xbox and PC on May 2nd",
    "body": "It's arriving several months later than expected, but Arkane's next big game is (relatively) close at hand. The studio has confirmed that Redfall will be available on May 2nd for Xbox Series X/S and Windows PCs, with launch day access through Game Pass. As be…",
    "url": "https://www.engadget.com/redfall-release-date-xbox-pc-214910117.html",
    "urlImage": "https://s.yimg.com/os/creatr-uploaded-images/2023-01/212eec70-9cf4-11ed-bbfe-8c3a12a5c6f7",
    "hasImage": true,
    "comments": {
      "body": "Its arriving several months later than expected but Arkanes next big game is relatively close at hand The studio has confirmed that Redfall will be available on May 2nd for Xbox Series XS and Windows PCs with launch day access through Game Pass As be"
    }
  },
  "NewsApi-Stuck at home, happy plants will keep me company": {
    "type": "NewsApi",
    "title": "Stuck at home, happy plants will keep me company",
    "body": "Working from home while convalescing from a niggling illness, Allan Jenkins contemplates the growth around himI am back being poorly. Confined to our London flat. Perhaps the long walks in driving Danish winter rain took more out of me than I’d realised.So my…",
    "url": "https://www.theguardian.com/lifeandstyle/2023/jan/22/stuck-at-home-happy-plants-will-keep-me-company",
    "urlImage": "https://i.guim.co.uk/img/media/2cb6bf45a42f43b1643f0639cbb22e99d95de250/0_142_3024_1814/master/3024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=4b1debc738f24ec65ae200e225672c09",
    "hasImage": true,
    "comments": {
      "body": "Working from home while convalescing from a niggling illness Allan Jenkins contemplates the growth around himI am back being poorly Confined to our London flat Perhaps the long walks in driving Danish winter rain took more out of me than Id realisedSo my"
    }
  },
  "NewsApi-Happy Valley recap: series three, episode four – pandemonium in court!": {
    "type": "NewsApi",
    "title": "Happy Valley recap: series three, episode four – pandemonium in court!",
    "body": "From that pulsating, propulsive closing sequence to Rob’s mysterious new suitcase, it was yet another stress-packed hour of sublime dramaSpoiler alert: this recap is published after Happy Valley airs on BBC One in the UK. Do not read on if you haven’t watched…",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/22/happy-valley-recap-series-three-episode-four-pandemonium-in-court",
    "urlImage": "https://i.guim.co.uk/img/media/89a74529f36cc0079ba1b331914d6e663b703ed7/106_0_3180_1908/master/3180.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c7757e2a7cd71b4e3b71eeea4a646148",
    "hasImage": true,
    "comments": {
      "body": "From that pulsating propulsive closing sequence to Robs mysterious new suitcase it was yet another stresspacked hour of sublime dramaSpoiler alert this recap is published after Happy Valley airs on BBC One in the UK Do not read on if you havent watched"
    }
  },
  "NewsApi-Michael Carrick happy to continue his quiet revolution at Middlesbrough": {
    "type": "NewsApi",
    "title": "Michael Carrick happy to continue his quiet revolution at Middlesbrough",
    "body": "The former England midfielder has flown largely under the radar during his fledgling managerial career on TeessideAs a midfielder Michael Carrick was so subtly intelligent that spectators in the stands sometimes barely noticed his consistent success in shapin…",
    "url": "https://www.theguardian.com/football/2023/jan/06/michael-carrick-happy-to-continue-his-quiet-revolution-at-middlesbrough",
    "urlImage": "https://i.guim.co.uk/img/media/537d96330439c5494938d92e7ca2135e8851cfdb/0_282_3500_2099/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7ecf25f2757d4596b8194a0b07560671",
    "hasImage": true,
    "comments": {
      "body": "The former England midfielder has flown largely under the radar during his fledgling managerial career on TeessideAs a midfielder Michael Carrick was so subtly intelligent that spectators in the stands sometimes barely noticed his consistent success in shapin"
    }
  },
  "NewsApi-Happy Valley finale kept secret from show’s stars": {
    "type": "NewsApi",
    "title": "Happy Valley finale kept secret from show’s stars",
    "body": "Multiple endings have been filmed, so even the cast of the BBC drama has no idea how it will concludeIf after four episodes of Happy Valley’s final season you still have no idea how it is going to finish, you are in good company. Not even the cast knows how t…",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/24/happy-valley-finale-kept-secret-from-shows-stars",
    "urlImage": "https://i.guim.co.uk/img/media/11c2adcbb4a6ada509f2aaf9d8f2196d9e79f8e0/0_0_5300_3182/master/5300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9836ed2072de7f72bbc8b04fe6ca069b",
    "hasImage": true,
    "comments": {
      "body": "Multiple endings have been filmed so even the cast of the BBC drama has no idea how it will concludeIf after four episodes of Happy Valleys final season you still have no idea how it is going to finish you are in good company Not even the cast knows how t"
    }
  },
  "NewsApi-Tell us: how do you think Happy Valley will end?": {
    "type": "NewsApi",
    "title": "Tell us: how do you think Happy Valley will end?",
    "body": "We would like to hear your theories on how the series will endAs the finale of Happy Valley approaches, we want to hear your theories on how it will end.What will happen in the standoff between Catherine and Tommy Lee Royce? Will TLR take Ryan away? Will they…",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/31/tell-us-how-do-you-think-happy-valley-will-end",
    "urlImage": "https://i.guim.co.uk/img/media/4328571dd9f7028f5562a9212788ffb31bd67133/0_176_5300_3182/master/5300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=023b185993ef169cdc822897c86e3e20",
    "hasImage": true,
    "comments": {
      "body": "We would like to hear your theories on how the series will endAs the finale of Happy Valley approaches we want to hear your theories on how it will endWhat will happen in the standoff between Catherine and Tommy Lee Royce Will TLR take Ryan away Will they"
    }
  },
  "NewsApi-Payoff personal loans from Happy Money review 2023": {
    "type": "NewsApi",
    "title": "Payoff personal loans from Happy Money review 2023",
    "body": "Explore Insider's review of Payoff personal loans from Happy Money. Discover if Payoff is a good personal loan product and worth it for your 2023 budget needs.",
    "url": "https://www.businessinsider.com/personal-finance/happy-money-payoff-personal-loans-review",
    "urlImage": "https://i.insider.com/60abb114e25d05001880d117?width=1200&format=jpeg",
    "hasImage": true,
    "comments": {
      "body": "Explore Insiders review of Payoff personal loans from Happy Money Discover if Payoff is a good personal loan product and worth it for your 2023 budget needs"
    }
  },
  "NewsApi-Automated Drip Watering Device Keeps Plants Happy": {
    "type": "NewsApi",
    "title": "Automated Drip Watering Device Keeps Plants Happy",
    "body": "Plants tend to need a regular supply of water to stay happy. If you’re a green thumb, it’s one of the primary things you should take care of before you go on holiday. This DIY plant wat…",
    "url": "https://hackaday.com/2023/01/20/automated-drip-watering-device-keeps-plants-happy/",
    "urlImage": "https://hackaday.com/wp-content/uploads/2023/01/F14DG7LLBW8LQX8.png",
    "hasImage": true,
    "comments": {
      "body": "Plants tend to need a regular supply of water to stay happy If youre a green thumb its one of the primary things you should take care of before you go on holiday This DIY plant wat"
    }
  },
  "NewsApi-Pegula happy to stay out of the spotlight after moving into second ... - Reuters.com": {
    "type": "NewsApi",
    "title": "Pegula happy to stay out of the spotlight after moving into second ... - Reuters.com",
    "body": "Jessica Pegula says she is happy to keep flying under the radar at the Australian Open after the American breezed into the second round on Monday with a 6-0 6-1 win over Romania's Jaqueline Cristian.",
    "url": "https://www.reuters.com/lifestyle/sports/pegula-happy-stay-out-spotlight-after-moving-into-second-round-2023-01-16/",
    "urlImage": "https://www.reuters.com/resizer/ILDAKDXsaXp48LPkIpO-KcoN5rk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/IPFU7LIX4BP7RAMV7WIJ74P56A.jpg",
    "hasImage": true,
    "comments": {
      "body": "Jessica Pegula says she is happy to keep flying under the radar at the Australian Open after the American breezed into the second round on Monday with a 60 61 win over Romanias Jaqueline Cristian"
    }
  },
  "NewsApi-I don't want to be a happy flowers team, says frustrated Guardiola - Reuters.com": {
    "type": "NewsApi",
    "title": "I don't want to be a happy flowers team, says frustrated Guardiola - Reuters.com",
    "body": "Manchester City coach Pep Guardiola turned on his players for lacking passion and said the club's supporters were \"silent\" in an extraordinary rant following the champions' 4-2 comeback victory over Tottenham Hotspur on Thursday.",
    "url": "https://www.reuters.com/lifestyle/sports/i-dont-want-be-happy-flowers-team-says-frustrated-guardiola-2023-01-20/",
    "urlImage": "https://www.reuters.com/resizer/KuaPsrfcwNs0TEexQpJckiugcJw=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/GSK3AC3AVBLLBH4V3DE7BW3I3Y.jpg",
    "hasImage": true,
    "comments": {
      "body": "Manchester City coach Pep Guardiola turned on his players for lacking passion and said the clubs supporters were silent in an extraordinary rant following the champions 42 comeback victory over Tottenham Hotspur on Thursday"
    }
  },
  "NewsApi-Paris Hilton appears to announce arrival of her first baby": {
    "type": "NewsApi",
    "title": "Paris Hilton appears to announce arrival of her first baby",
    "body": "Paris Hilton seems to have announced the birth of her first child with husband Carter Reum.",
    "url": "https://www.cnn.com/2023/01/25/entertainment/paris-hilton-first-baby-announcement-intl-scli/index.html",
    "urlImage": "https://media.cnn.com/api/v1/images/stellar/prod/230125040322-01-paris-hilton-062922-restricted.jpg?c=16x9&q=w_800,c_fill",
    "hasImage": true,
    "comments": {
      "body": "Paris Hilton seems to have announced the birth of her first child with husband Carter Reum"
    }
  },
  "NewsApi-I’m really happy with my boyfriend – so why don’t I want to have sex with him?": {
    "type": "NewsApi",
    "title": "I’m really happy with my boyfriend – so why don’t I want to have sex with him?",
    "body": "I used to have exciting sexual liaisons with men who treated me badly. Now I’ve found my soulmate, I don’t understand why he doesn’t turn me onI’ve been with my boyfriend for 10 months and I’ve never been happier. We’ve got loads in common and he’s driven, fu…",
    "url": "https://www.theguardian.com/lifeandstyle/2023/jan/31/im-really-happy-with-my-boyfriend-so-why-dont-i-want-to-have-sex-with-him",
    "urlImage": "https://i.guim.co.uk/img/media/35a77257de67efff0279bb3a1ef4597b134e3e65/0_0_4724_2835/master/4724.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5363b771a4d2b7b3e79f2d788a09ef9",
    "hasImage": true,
    "comments": {
      "body": "I used to have exciting sexual liaisons with men who treated me badly Now Ive found my soulmate I dont understand why he doesnt turn me onIve been with my boyfriend for 10 months and Ive never been happier Weve got loads in common and hes driven fu"
    }
  },
  "NewsApi-Happy birthday to They Might Be Giants' 1990 album Flood": {
    "type": "NewsApi",
    "title": "Happy birthday to They Might Be Giants' 1990 album Flood",
    "body": "\"Why is the world in love again?\n\n\n\nWhy are we marching hand in hand? \n\n\n\nWhy are the ocean levels rising up?\n\n\n\nIt's a brand new record, for 1990\n\n\n\nThey Might Be Giants' brand new album Flood\"\n\n\n\nHappy birthday to this amazing album. — Read the rest",
    "url": "https://boingboing.net/2023/01/16/happy-birthday-to-they-might-be-giants-flood.html",
    "urlImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/01/Screen-Shot-2023-01-15-at-6.53.37-PM.png?fit=988%2C878&ssl=1",
    "hasImage": true,
    "comments": {
      "body": "Why is the world in love againWhy are we marching hand in hand Why are the ocean levels rising upIts a brand new record for 1990They Might Be Giants brand new album FloodHappy birthday to this amazing album  Read the rest"
    }
  },
  "NewsApi-Life in Happy Valley is grim – but there’s nowhere I’d rather spend January | Emma Brockes": {
    "type": "NewsApi",
    "title": "Life in Happy Valley is grim – but there’s nowhere I’d rather spend January | Emma Brockes",
    "body": "Sarah Lancashire is back in Sally Wainwright’s stupendous series, and both are better than everIt has been almost seven years since we were last up Ripponden, in the BBC drama Happy Valley, and to judge by the reception this week, you’d have thought it a retu…",
    "url": "https://www.theguardian.com/commentisfree/2023/jan/05/happy-valley-sarah-lancashire-sally-wainwright-series",
    "urlImage": "https://i.guim.co.uk/img/media/1419234596a4c302fa396dcd60a71d97242f435a/0_188_5300_3179/master/5300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=d2e3abd51a18672ddcb529da5136500f",
    "hasImage": true,
    "comments": {
      "body": "Sarah Lancashire is back in Sally Wainwrights stupendous series and both are better than everIt has been almost seven years since we were last up Ripponden in the BBC drama Happy Valley and to judge by the reception this week youd have thought it a retu"
    }
  },
  "NewsApi-Daria Kasatkina: ‘Coming out helped me. I just felt much better, I’m happy with the outcome’": {
    "type": "NewsApi",
    "title": "Daria Kasatkina: ‘Coming out helped me. I just felt much better, I’m happy with the outcome’",
    "body": "It’s been a tumultuous year for Russian player who has been banned from Wimbledon, spoken out against the war in Ukraine and over her own sexualityThe word “courage” is used a lot in tennis circles, usually to reference some unlikely victory or an outstanding…",
    "url": "https://www.theguardian.com/sport/2023/jan/16/daria-kasatkina-australian-open-coming-out-happy-russia-war-ukraine",
    "urlImage": "https://i.guim.co.uk/img/media/4640c2d310b2405d1c65397aed920f694a41162f/0_22_3516_2110/master/3516.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ebb3eaebf505cea81943d242165b0657",
    "hasImage": true,
    "comments": {
      "body": "Its been a tumultuous year for Russian player who has been banned from Wimbledon spoken out against the war in Ukraine and over her own sexualityThe word courage is used a lot in tennis circles usually to reference some unlikely victory or an outstanding"
    }
  },
  "NewsApi-ECB’s Mo Bobat happy for Steve Smith to gear up for Ashes in county cricket": {
    "type": "NewsApi",
    "title": "ECB’s Mo Bobat happy for Steve Smith to gear up for Ashes in county cricket",
    "body": "<ul><li>Australian batter has been linked with move to Sussex</li><li>‘Any good player coming over, he’s going to raise standard’</li></ul>Mo Bobat, the performance director for men’s cricket at the ECB, has cautiously welcomed the possibility of Australia’s …",
    "url": "https://www.theguardian.com/sport/2023/jan/13/ecbs-mo-bobat-happy-for-steve-smith-to-gear-up-for-ashes-in-county-cricket",
    "urlImage": "https://i.guim.co.uk/img/media/dcaa65a9a25069e9de4cebbb7e6797dcbf3e439b/0_153_4201_2521/master/4201.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1a1d968482f1e2cde3a591a4b9b1d983",
    "hasImage": true,
    "comments": {
      "body": "ulliAustralian batter has been linked with move to SussexliliAny good player coming over hes going to raise standardliulMo Bobat the performance director for mens cricket at the ECB has cautiously welcomed the possibility of Australias "
    }
  },
  "NewsApi-Happy Valley recap: series three, episode five – is Tommy about to launch a siege?": {
    "type": "NewsApi",
    "title": "Happy Valley recap: series three, episode five – is Tommy about to launch a siege?",
    "body": "Danger seemed to lurk at every turn in this penultimate episode of the BBC drama. Catherine and her nemesis are now firmly locked on collision courseSpoiler alert: this recap is published after Happy Valley airs on BBC One in the UK. Do not read on if you hav…",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/29/happy-valley-recap-series-three-episode-five-is-tommy-about-to-launch-a-siege",
    "urlImage": "https://i.guim.co.uk/img/media/99122d59929b12bec96c32318bbfb80e2f90452b/0_345_6182_3709/master/6182.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c454638632b238be2c7f5f55cce9ee7b",
    "hasImage": true,
    "comments": {
      "body": "Danger seemed to lurk at every turn in this penultimate episode of the BBC drama Catherine and her nemesis are now firmly locked on collision courseSpoiler alert this recap is published after Happy Valley airs on BBC One in the UK Do not read on if you hav"
    }
  },
  "NewsApi-I’m turning into my mother – and it makes me so happy | Emma Beddington": {
    "type": "NewsApi",
    "title": "I’m turning into my mother – and it makes me so happy | Emma Beddington",
    "body": "Almost 20 years after Mum died, I find myself spoiling my son just like she spoiled me. Suddenly she feels very closeTurning into your parents is a loaded notion. A gesture, a jawline, a phrase that emerges from your mouth without conscious thought, maybe som…",
    "url": "https://www.theguardian.com/commentisfree/2023/jan/30/im-turning-into-my-mother-and-it-makes-me-so-happy",
    "urlImage": "https://i.guim.co.uk/img/media/fd4b9ea88c556f1e9a0d34f6c46af51e06cb89a3/1329_441_6781_4069/master/6781.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=47949c48d9eeee76014038b9fa616e90",
    "hasImage": true,
    "comments": {
      "body": "Almost 20 years after Mum died I find myself spoiling my son just like she spoiled me Suddenly she feels very closeTurning into your parents is a loaded notion A gesture a jawline a phrase that emerges from your mouth without conscious thought maybe som"
    }
  },
  "NewsApi-‘Tommy sacrifices himself’ – your fan theories on how Happy Valley will end": {
    "type": "NewsApi",
    "title": "‘Tommy sacrifices himself’ – your fan theories on how Happy Valley will end",
    "body": "From UFO abductions to Ryan’s dad deciding to embody his Jesus-like mane, speculation is rife as to how Sally Wainwright’s hit drama will bow out. Here are your most intriguing guesses …I believe Clare will be the character who dies at the hands of Tommy Lee …",
    "url": "https://www.theguardian.com/tv-and-radio/2023/feb/02/tommy-sacrifices-himself-your-fan-theories-on-how-happy-valley-will-end",
    "urlImage": "https://i.guim.co.uk/img/media/24ebd63a80f3d7bc4383d99c9454a60868c37287/0_175_5300_3182/master/5300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d169e62389beab0747615024e9071cca",
    "hasImage": true,
    "comments": {
      "body": "From UFO abductions to Ryans dad deciding to embody his Jesuslike mane speculation is rife as to how Sally Wainwrights hit drama will bow out Here are your most intriguing guesses I believe Clare will be the character who dies at the hands of Tommy Lee "
    }
  },
  "NewsApi-A lowly sergeant, but Happy Valley’s Catherine Cawood is top of the cops | Rachel Cooke": {
    "type": "NewsApi",
    "title": "A lowly sergeant, but Happy Valley’s Catherine Cawood is top of the cops | Rachel Cooke",
    "body": "Sarah Lancashire’s portrayal in the hit series is 10 times tougher than her TV predecessorsI can measure out my life, not with coffee spoons, but in female cops. First, there was Insp Jean Darblay (as played by Stephanie Turner) in Juliet Bravo, who had the y…",
    "url": "https://www.theguardian.com/commentisfree/2023/feb/04/happy-valley-catherine-cawood-is-top-of-the-cops",
    "urlImage": "https://i.guim.co.uk/img/media/fa4fc72a0c88f7cd7bbe6ddca3863e9cfd32f5d6/0_59_4666_2799/master/4666.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=58c9ec5123c0e7b1a90c4c8f2b611da8",
    "hasImage": true,
    "comments": {
      "body": "Sarah Lancashires portrayal in the hit series is 10 times tougher than her TV predecessorsI can measure out my life not with coffee spoons but in female cops First there was Insp Jean Darblay as played by Stephanie Turner in Juliet Bravo who had the y"
    }
  },
  "NewsApi-Quietly quitting: why Naomi Osaka is happy to drift away from tennis | Jonathan Liew": {
    "type": "NewsApi",
    "title": "Quietly quitting: why Naomi Osaka is happy to drift away from tennis | Jonathan Liew",
    "body": "The former Australian Open champion is not competing in Melbourne this year, having rejected the grind of the tourA long time ago, I took a part-time job in a high-street clothing store. It was late November, and amid the chaos of the Christmas rush I quickly…",
    "url": "https://www.theguardian.com/sport/blog/2023/jan/10/quietly-quitting-why-naomi-osaka-is-happy-to-drift-away-from-tennis",
    "urlImage": "https://i.guim.co.uk/img/media/f668ab873827b07da9fbf6828a71072ebd6c7487/0_289_4485_2691/master/4485.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=eeeed73e01e5a57700d667c68c561628",
    "hasImage": true,
    "comments": {
      "body": "The former Australian Open champion is not competing in Melbourne this year having rejected the grind of the tourA long time ago I took a parttime job in a highstreet clothing store It was late November and amid the chaos of the Christmas rush I quickly"
    }
  },
  "NewsApi-Chelsea confirm loan signing of ‘very happy’ João Félix from Atlético Madrid": {
    "type": "NewsApi",
    "title": "Chelsea confirm loan signing of ‘very happy’ João Félix from Atlético Madrid",
    "body": "<ul><li>Portugal international joins for remainder of the season</li><li>‘I’m very excited to play at Stamford Bridge,’ he says</li></ul>Chelsea have confirmed the signing of João Félix on a loan deal from Atlético Madrid for the remainder of the season.Chels…",
    "url": "https://www.theguardian.com/football/2023/jan/11/chelsea-confirm-loan-signing-of-very-happy-joao-felix-from-atletico-madrid-transfer-window",
    "urlImage": "https://i.guim.co.uk/img/media/bcd720212dc5cafaa20fd3fde80a7b8b641814f1/3_0_1220_732/master/1220.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f4bc3f53bd6ee56148389c4d1564839e",
    "hasImage": true,
    "comments": {
      "body": "ulliPortugal international joins for remainder of the seasonliliIm very excited to play at Stamford Bridge he saysliulChelsea have confirmed the signing of João Félix on a loan deal from Atlético Madrid for the remainder of the seasonChels"
    }
  },
  "NewsApi-‘Happy to let it hang out’: budgie smugglers are back on Australian beaches": {
    "type": "NewsApi",
    "title": "‘Happy to let it hang out’: budgie smugglers are back on Australian beaches",
    "body": "Australian men have their reasons for pulling these tight togs back on. For some it’s irony; for others, pride. But for many it is simply a matter of comfort<ul><li>Get our weekend culture and lifestyle email</li></ul>In the birthplace of the budgie smuggler,…",
    "url": "https://www.theguardian.com/fashion/2023/jan/07/happy-to-let-it-hang-out-budgie-smugglers-are-back-on-australian-beaches",
    "urlImage": "https://i.guim.co.uk/img/media/011dfe3ba8f98db0c809c6b2b1406e25a87f1a93/0_22_5839_3504/master/5839.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d8c1d5d1691a37b35373fe5df1fe6e65",
    "hasImage": true,
    "comments": {
      "body": "Australian men have their reasons for pulling these tight togs back on For some its irony for others pride But for many it is simply a matter of comfortulliGet our weekend culture and lifestyle emailliulIn the birthplace of the budgie smuggler"
    }
  },
  "NewsApi-Henry Slade shows his old class as Exeter overcome card-happy Castres": {
    "type": "NewsApi",
    "title": "Henry Slade shows his old class as Exeter overcome card-happy Castres",
    "body": "<ul><li>Pool A: Exeter 40-3 Castres</li><li>Scrappy French side pick up one red card and three yellows</li></ul>They claim a home tie in the final 16, but Exeter looked as off-colour in overcoming a motiveless Castres as any of the English sides who have labo…",
    "url": "https://www.theguardian.com/sport/2023/jan/21/henry-slade-shows-his-old-class-as-exeter-overcome-card-happy-castres",
    "urlImage": "https://i.guim.co.uk/img/media/01f3a773cf73acd7cbe356c2ac4d784d11b49ea7/0_13_4860_2917/master/4860.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=daa1757857b033c961decb2f318bd1ed",
    "hasImage": true,
    "comments": {
      "body": "ulliPool A Exeter 403 CastresliliScrappy French side pick up one red card and three yellowsliulThey claim a home tie in the final 16 but Exeter looked as offcolour in overcoming a motiveless Castres as any of the English sides who have labo"
    }
  },
  "NewsApi-‘I jumped off the hangover hamster wheel’: midlife drinkers who gave up booze – and got happy": {
    "type": "NewsApi",
    "title": "‘I jumped off the hangover hamster wheel’: midlife drinkers who gave up booze – and got happy",
    "body": "In the UK, those aged 55 to 75 are the heaviest drinkers, with the generation below not far behind. But many are turning their backs on alcohol and discovering surprising benefitsSharon Hartley considered herself a fairly average drinker. She had followed a s…",
    "url": "https://www.theguardian.com/society/2023/jan/24/hangover-midlife-drinkers-booze-alcohol",
    "urlImage": "https://i.guim.co.uk/img/media/c4d0c015607cc4b5a7fa71ec7704394a1ef8f9c9/529_253_1798_1079/master/1798.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7a3d02084b565a9a98897cd934d1f869",
    "hasImage": true,
    "comments": {
      "body": "In the UK those aged 55 to 75 are the heaviest drinkers with the generation below not far behind But many are turning their backs on alcohol and discovering surprising benefitsSharon Hartley considered herself a fairly average drinker She had followed a s"
    }
  },
  "NewsApi-Happy Valley recap: series three, episode three – that confrontation scene deserves Baftas": {
    "type": "NewsApi",
    "title": "Happy Valley recap: series three, episode three – that confrontation scene deserves Baftas",
    "body": "Things came to a head for Catherine and Clare in a devastating, 11-minute two-hander. Can harmony be restored in the Cawood clan? And how is Faisal going to get out of this mess?Spoiler alert: this recap is published after Happy Valley airs on BBC One in the …",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/15/happy-valley-recap-series-three-episode-three-that-confrontation-scene-deserves-baftas",
    "urlImage": "https://i.guim.co.uk/img/media/415576765a6f3750182943ce22147c35dc0c90c7/0_146_6240_3744/master/6240.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6e5e94944a6e358da75b5672f2e5f2ef",
    "hasImage": true,
    "comments": {
      "body": "Things came to a head for Catherine and Clare in a devastating 11minute twohander Can harmony be restored in the Cawood clan And how is Faisal going to get out of this messSpoiler alert this recap is published after Happy Valley airs on BBC One in the "
    }
  },
  "NewsApi-‘I’m so happy’: Chelsea confirm Mykhailo Mudryk deal for initial €70m": {
    "type": "NewsApi",
    "title": "‘I’m so happy’: Chelsea confirm Mykhailo Mudryk deal for initial €70m",
    "body": "<ul><li>Ukrainian moves from Shakhtar with add-ons worth €30m</li><li>Winger in attendance at Stamford Bridge for visit of Palace</li></ul>Chelsea have completed the signing of Mykhailo Mudryk from Shakhtar Donetsk, with the winger in attendance at Stamford B…",
    "url": "https://www.theguardian.com/football/2023/jan/15/chelsea-confirm-mykhailo-mudryk-deal-for-initial-70m",
    "urlImage": "https://i.guim.co.uk/img/media/49ac2c96e4d117b0e9e763f4b430a12fca1db4d2/326_188_4570_2744/master/4570.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f870e786219c776735d8bbf332451114",
    "hasImage": true,
    "comments": {
      "body": "ulliUkrainian moves from Shakhtar with addons worth 30mliliWinger in attendance at Stamford Bridge for visit of PalaceliulChelsea have completed the signing of Mykhailo Mudryk from Shakhtar Donetsk with the winger in attendance at Stamford B"
    }
  },
  "NewsApi-Football Daily | Pep Guardiola’s ‘happy flowers’ set the ears of Manchester City burning": {
    "type": "NewsApi",
    "title": "Football Daily | Pep Guardiola’s ‘happy flowers’ set the ears of Manchester City burning",
    "body": "Sign up now! Sign up now! Sign up now? Sign up now!When a football manager grasps for an odd metaphor, it’s often a sign things are going a bit milky. Once Pep Guardiola wailed “we are a happy flowers team, I don’t want this”, the gong bath started filling. H…",
    "url": "https://www.theguardian.com/football/2023/jan/20/football-daily-email-pep-guardiola-manchester-city-happy-flowers",
    "urlImage": "https://i.guim.co.uk/img/media/7af4eae99618eaca43383caccb98d43a4eb861ea/0_174_2611_1567/master/2611.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=59d0d39109be318870b2a307b6617b35",
    "hasImage": true,
    "comments": {
      "body": "Sign up now Sign up now Sign up now Sign up nowWhen a football manager grasps for an odd metaphor its often a sign things are going a bit milky Once Pep Guardiola wailed we are a happy flowers team I dont want this the gong bath started filling H"
    }
  },
  "NewsApi-Graffiti, grammar and farts: how small moments make Happy Valley an all-time great": {
    "type": "NewsApi",
    "title": "Graffiti, grammar and farts: how small moments make Happy Valley an all-time great",
    "body": "Sally Wainwright’s astounding drama might be a propulsive, plot-driven beast, but it’s TV perfection for another reason – the warm, spectacularly written detailsFor the past six weeks, it has felt as if the country has stuck to the exact same Sunday routine. …",
    "url": "https://www.theguardian.com/tv-and-radio/2023/feb/03/happy-valley-graffiti-grammar-and-farts-how-small-moments-make-happy-valley-an-all-time-great",
    "urlImage": "https://i.guim.co.uk/img/media/010d3ec0e91cb8dc7676a37ddce5c288f0266fd1/0_32_6240_3744/master/6240.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=17c54be2a38d362057beb0e766a614d0",
    "hasImage": true,
    "comments": {
      "body": "Sally Wainwrights astounding drama might be a propulsive plotdriven beast but its TV perfection for another reason  the warm spectacularly written detailsFor the past six weeks it has felt as if the country has stuck to the exact same Sunday routine "
    }
  },
  "NewsApi-Will Catherine die? The Happy Valley characters least likely to make it out alive": {
    "type": "NewsApi",
    "title": "Will Catherine die? The Happy Valley characters least likely to make it out alive",
    "body": "As the explosive climax of Sally Wainwright’s series looms, someone’s painful death feels inevitable. Will it be Tommy? Horrible Hepworth? Ryan? We rate their chancesSunday night’s Happy Valley finale is poised to be the most unbearably tense 70 minutes of 20…",
    "url": "https://www.theguardian.com/tv-and-radio/2023/feb/04/will-catherine-die-the-happy-valley-characters-least-likely-to-make-it-out-alive",
    "urlImage": "https://i.guim.co.uk/img/media/4328571dd9f7028f5562a9212788ffb31bd67133/0_269_5300_3182/master/5300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8a27acfd7bfd8c708eb2357ccfef3a10",
    "hasImage": true,
    "comments": {
      "body": "As the explosive climax of Sally Wainwrights series looms someones painful death feels inevitable Will it be Tommy Horrible Hepworth Ryan We rate their chancesSunday nights Happy Valley finale is poised to be the most unbearably tense 70 minutes of 20"
    }
  },
  "NewsApi-Potter admits challenge of keeping larger dressing room happy at Chelsea": {
    "type": "NewsApi",
    "title": "Potter admits challenge of keeping larger dressing room happy at Chelsea",
    "body": "<ul><li>Eight January signings including £106.8m Enzo Fernández</li><li>Total spending now more than £500m under Todd Boehly</li></ul>Graham Potter has admitted it will be challenging to maintain dressing-room harmony after Chelsea increased the size of their…",
    "url": "https://www.theguardian.com/football/2023/feb/02/graham-potter-admits-challenge-of-keeping-dressing-room-happy-at-chelsea",
    "urlImage": "https://i.guim.co.uk/img/media/b730e05161798f8ac7bc3df2b60a5676469cfc33/927_516_2946_1769/master/2946.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b0130c996a5d297a6220b1ab0e525d03",
    "hasImage": true,
    "comments": {
      "body": "ulliEight January signings including 1068m Enzo FernándezliliTotal spending now more than 500m under Todd BoehlyliulGraham Potter has admitted it will be challenging to maintain dressingroom harmony after Chelsea increased the size of their"
    }
  },
  "NewsApi-Analysis: Investors snap up record $39 bln emerging market ... - Reuters.com": {
    "type": "NewsApi",
    "title": "Analysis: Investors snap up record $39 bln emerging market ... - Reuters.com",
    "body": "Developing countries have sold a huge $39 billion of international bonds since the start of the year, with investors happy to pile into riskier debt as they bet global interest rates are nearing a peak.",
    "url": "https://www.reuters.com/markets/emerging/investors-snap-up-record-39-bln-emerging-market-sovereign-bond-splurge-2023-01-13/",
    "urlImage": "https://www.reuters.com/resizer/y--jZm6k-totS296vSD6B5RsD9Q=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/KGOUJV2AW5PB7B7YEA4SV5FXKY.jpg",
    "hasImage": true,
    "comments": {
      "body": "Developing countries have sold a huge 39 billion of international bonds since the start of the year with investors happy to pile into riskier debt as they bet global interest rates are nearing a peak"
    }
  },
  "NewsApi-Monterey Park shooting turns mass celebration into massacre on ... - Reuters": {
    "type": "NewsApi",
    "title": "Monterey Park shooting turns mass celebration into massacre on ... - Reuters",
    "body": "The red lanterns bobbed and banners proclaimed \"Happy Year of the Rabbit\" but Monterey Park's famous Lunar New Year festivities were brought to an abrupt end by a shooting that left 10 people dead and another 10 wounded.",
    "url": "https://www.reuters.com/world/us/monterey-park-shooting-turns-mass-celebration-into-massacre-lunar-new-year-2023-01-22/",
    "urlImage": "https://www.reuters.com/resizer/SPauC1-EEd4TYtsF-O7wAd0c044=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/X6TC7VLKNVMWTC3KX33D2Q2PNA.jpg",
    "hasImage": true,
    "comments": {
      "body": "The red lanterns bobbed and banners proclaimed Happy Year of the Rabbit but Monterey Parks famous Lunar New Year festivities were brought to an abrupt end by a shooting that left 10 people dead and another 10 wounded"
    }
  },
  "NewsApi-Nadal shrugs off rocky buildup to Australian Open defence - Reuters": {
    "type": "NewsApi",
    "title": "Nadal shrugs off rocky buildup to Australian Open defence - Reuters",
    "body": "An upbeat Rafa Nadal has shrugged off his warm-up defeats ahead of the Australian Open as \"just part of the business\" and declared himself in a happy place ahead of his title defence.",
    "url": "https://www.reuters.com/lifestyle/sports/nadal-shrugs-off-rocky-buildup-australian-open-defence-2023-01-14/",
    "urlImage": "https://www.reuters.com/resizer/ZfRGE2eocj3gBk6tzrCI8LfwS8E=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/4LVAC6Z2VNNRBFX7NZWPLB3ANI.jpg",
    "hasImage": true,
    "comments": {
      "body": "An upbeat Rafa Nadal has shrugged off his warmup defeats ahead of the Australian Open as just part of the business and declared himself in a happy place ahead of his title defence"
    }
  },
  "NewsApi-I used to look down on giving people gift cards — until 2 of the best gifts I've gotten made me rethink my stance": {
    "type": "NewsApi",
    "title": "I used to look down on giving people gift cards — until 2 of the best gifts I've gotten made me rethink my stance",
    "body": "When I embrace gift cards, my friends and family can be perfectly happy with their presents, with a lot less effort from me.",
    "url": "https://www.businessinsider.com/personal-finance/love-giving-gift-cards-after-favorite-gifts-2023-1",
    "urlImage": "https://i.insider.com/63b5a0187f62b200191a46f2?width=1200&format=jpeg",
    "hasImage": true,
    "comments": {
      "body": "When I embrace gift cards my friends and family can be perfectly happy with their presents with a lot less effort from me"
    }
  },
  "NewsApi-Biden flubbed the name of Martin Luther King Jr.'s daughter-in-law while singing 'Happy Birthday' to her onstage": {
    "type": "NewsApi",
    "title": "Biden flubbed the name of Martin Luther King Jr.'s daughter-in-law while singing 'Happy Birthday' to her onstage",
    "body": "President Joe Biden suggested singing 'Happy Birthday' to Arndrea Waters King, led the song onstage, and mumbled incomprehensibly through her name.",
    "url": "https://www.businessinsider.com/biden-forgets-mlk-daughter-in-law-name-singing-happy-birthday-2023-1",
    "urlImage": "https://i.insider.com/63c5da36b4171f001957ffa3?width=1200&format=jpeg",
    "hasImage": true,
    "comments": {
      "body": "President Joe Biden suggested singing Happy Birthday to Arndrea Waters King led the song onstage and mumbled incomprehensibly through her name"
    }
  },
  "NewsApi-Firefighters smashed the window of a driverless Cruise taxi to stop it running over their hoses": {
    "type": "NewsApi",
    "title": "Firefighters smashed the window of a driverless Cruise taxi to stop it running over their hoses",
    "body": "San Francisco officials aren't happy that driverless taxis are running over firefighting hoses, but Cruise and Waymo aim to increase their operations.",
    "url": "https://www.businessinsider.com/san-francisco-firefighters-smashed-window-driverless-cruise-taxi-stop-it-2023-1",
    "urlImage": "https://i.insider.com/63d677cafc18470019553e52?width=1200&format=jpeg",
    "hasImage": true,
    "comments": {
      "body": "San Francisco officials arent happy that driverless taxis are running over firefighting hoses but Cruise and Waymo aim to increase their operations"
    }
  },
  "NewsApi-TV tonight: Vera – the queen of cosy crime action – is back for a new series": {
    "type": "NewsApi",
    "title": "TV tonight: Vera – the queen of cosy crime action – is back for a new series",
    "body": "Brenda Blethyn’s no-nonsense detective gets stuck into a new case. Plus: Happy Valley continues to be the best thing on TV right now. Here’s everything to watch this evening Continue reading...",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/15/tv-tonight-vera-the-queen-of-cosy-action-is-back-for-a-new-series",
    "urlImage": "https://i.guim.co.uk/img/media/ccdb39ca7442e6204975a88b26bc2fe90fe9d5fb/0_361_7352_4414/master/7352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1a999bbcf56915b702b42d6ec92cd599",
    "hasImage": true,
    "comments": {
      "body": "Brenda Blethyns nononsense detective gets stuck into a new case Plus Happy Valley continues to be the best thing on TV right now Heres everything to watch this evening Continue reading"
    }
  },
  "NewsApi-Elon Musk Sets a New Guinness World Record — But He Can't Be Happy About This One": {
    "type": "NewsApi",
    "title": "Elon Musk Sets a New Guinness World Record — But He Can't Be Happy About This One",
    "body": "One of the richest men in the world is also the biggest money loser.",
    "url": "https://www.entrepreneur.com/business-news/elon-musk-just-set-new-guinness-record-but-he-wont/442663",
    "urlImage": "https://assets.entrepreneur.com/content/3x2/2000/1673397868-GettyImages-1395200678.jpeg",
    "hasImage": true,
    "comments": {
      "body": "One of the richest men in the world is also the biggest money loser"
    }
  },
  "NewsApi-The secret to a happy life -- lessons from 8 decades of research | Robert Waldinger": {
    "type": "NewsApi",
    "title": "The secret to a happy life -- lessons from 8 decades of research | Robert Waldinger",
    "body": "The happiest and healthiest people are those who have warm connections with others, says psychiatrist Robert Waldinger, who leads the Harvard Study of Adult Development -- one of the longest-running studies of adult life ever conducted. Exploring the crucial …",
    "url": "https://www.ted.com/talks/robert_waldinger_the_secret_to_a_happy_life_lessons_from_8_decades_of_research",
    "urlImage": "https://pi.tedcdn.com/r/talkstar-photos.s3.amazonaws.com/uploads/dd2c601c-2509-49f2-ac7e-a214552e58d1/RobertWaldinger_2022H-embed.jpg?u%5Br%5D=2&u%5Bs%5D=0.5&u%5Ba%5D=0.8&u%5Bt%5D=0.03&quality=82c=1050%2C550&w=1050",
    "hasImage": true,
    "comments": {
      "body": "The happiest and healthiest people are those who have warm connections with others says psychiatrist Robert Waldinger who leads the Harvard Study of Adult Development  one of the longestrunning studies of adult life ever conducted Exploring the crucial "
    }
  },
  "NewsApi-EU vows to get tougher on Big Tech privacy violations": {
    "type": "NewsApi",
    "title": "EU vows to get tougher on Big Tech privacy violations",
    "body": "The European Union is eager to crack down on Big Tech's alleged privacy abuses, but the reliance on individual countries to enforce General Data Protection Regulation (GDPR) rules has led to lengthy cases with punishments that are frequently modest. There wil…",
    "url": "https://www.engadget.com/eu-tougher-gdpr-monitoring-big-tech-151519695.html",
    "urlImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-07/1cc72940-e382-11eb-bfff-9a3cc1c970f8",
    "hasImage": true,
    "comments": {
      "body": "The European Union is eager to crack down on Big Techs alleged privacy abuses but the reliance on individual countries to enforce General Data Protection Regulation GDPR rules has led to lengthy cases with punishments that are frequently modest There wil"
    }
  },
  "NewsApi-Facebook Messenger encrypted chats now include more of the features you expect": {
    "type": "NewsApi",
    "title": "Facebook Messenger encrypted chats now include more of the features you expect",
    "body": "You no longer have to give up the privacy of end-to-end encryption in Facebook Messenger just to get the creature comforts you take for granted. Meta is bringing several common features to encrypted chats. You can now choose themes, set profiles for group con…",
    "url": "https://www.engadget.com/facebook-messenger-encrypted-chat-custom-emoji-reactions-174054183.html",
    "urlImage": "https://s.yimg.com/os/creatr-uploaded-images/2023-01/bb7e60a0-9b3f-11ed-8e5d-7e1f9e099d56",
    "hasImage": true,
    "comments": {
      "body": "You no longer have to give up the privacy of endtoend encryption in Facebook Messenger just to get the creature comforts you take for granted Meta is bringing several common features to encrypted chats You can now choose themes set profiles for group con"
    }
  },
  "NewsApi-Tiptoeing Into 2023 Stock Market...": {
    "type": "NewsApi",
    "title": "Tiptoeing Into 2023 Stock Market...",
    "body": "Hey y'all! Happy 2023! I hope everyone is ready to ring in the new year with happiness and positivity. Unfortunately, there's a chance the stock market (SPY) is planning to...",
    "url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-tiptoeing-into-2023-stock-market/",
    "urlImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-442258.jpeg",
    "hasImage": true,
    "comments": {
      "body": "Hey yall Happy 2023 I hope everyone is ready to ring in the new year with happiness and positivity Unfortunately theres a chance the stock market SPY is planning to"
    }
  },
  "NewsApi-Eight of the Best Self-Soothing Techniques for Little Kids": {
    "type": "NewsApi",
    "title": "Eight of the Best Self-Soothing Techniques for Little Kids",
    "body": "Babies are easy to soothe, right? Give them something to suck or wrap them up in a tight swaddle, and they melt in your arms. For little kids, a parent’s hug is still probably the most soothing response to their Big Feelings, but Mom and Dad are not always ar…",
    "url": "https://lifehacker.com/eight-of-the-best-self-soothing-techniques-for-little-k-1849985033",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/80a3af5949b53fe50b363a276e513b5d.jpg",
    "hasImage": true,
    "comments": {
      "body": "Babies are easy to soothe right Give them something to suck or wrap them up in a tight swaddle and they melt in your arms For little kids a parents hug is still probably the most soothing response to their Big Feelings but Mom and Dad are not always ar"
    }
  },
  "NewsApi-Gaza's only all-girl boxing club finds a home": {
    "type": "NewsApi",
    "title": "Gaza's only all-girl boxing club finds a home",
    "body": "After training women on the beach and in a garage, Osama has now moved to a professional centre.",
    "url": "https://www.bbc.co.uk/news/av/world-middle-east-64420114",
    "urlImage": "https://ichef.bbci.co.uk/news/1024/branded_news/183DC/production/_128429299_gazacover.jpg",
    "hasImage": true,
    "comments": {
      "body": "After training women on the beach and in a garage Osama has now moved to a professional centre"
    }
  },
  "NewsApi-The platform and the curator": {
    "type": "NewsApi",
    "title": "The platform and the curator",
    "body": "Who has their hand on the dial? Talk with someone who works at Apple, Amazon, Google, Linkedin, Facebook, etc, and they’ll be happy to give you tips on how to work the platform to your advantage. How to get a bit more attention for your podcast or your websit…",
    "url": "https://seths.blog/2023/01/the-platform-and-the-curator/",
    "urlImage": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061310-1.jpg",
    "hasImage": true,
    "comments": {
      "body": "Who has their hand on the dial Talk with someone who works at Apple Amazon Google Linkedin Facebook etc and theyll be happy to give you tips on how to work the platform to your advantage How to get a bit more attention for your podcast or your websit"
    }
  },
  "NewsApi-You Can't Have a Thriving Business Without Happy Customers. Here's How to Keep Them in Your Corner.": {
    "type": "NewsApi",
    "title": "You Can't Have a Thriving Business Without Happy Customers. Here's How to Keep Them in Your Corner.",
    "body": "Customer experience is more than just a corporate buzzword. Use these tips and tricks to make sure you're treating your customers right.",
    "url": "https://www.entrepreneur.com/growing-a-business/5-ways-to-make-sure-you-always-treat-your-customers-right/440962",
    "urlImage": "https://assets.entrepreneur.com/content/3x2/2000/1674149455-GettyImages-608166817.jpg",
    "hasImage": true,
    "comments": {
      "body": "Customer experience is more than just a corporate buzzword Use these tips and tricks to make sure youre treating your customers right"
    }
  },
  "NewsApi-The Two Objects of the Good Life: Mary Shelley’s Father on the Relationship Between Personal Happiness, Imagination, and Social Harmony": {
    "type": "NewsApi",
    "title": "The Two Objects of the Good Life: Mary Shelley’s Father on the Relationship Between Personal Happiness, Imagination, and Social Harmony",
    "body": "\"The true object of education, like that of every other moral process, is the generation of happiness. Happiness to the individual in the first place. If individuals were universally happy, the species would be happy.\"",
    "url": "https://www.themarginalian.org/2023/01/30/william-godwin-enquirer-education/",
    "urlImage": "https://www.themarginalian.org/wp-content/uploads/2019/01/margaretcook_leavesofgrass0000.jpg?fit=600%2C315&ssl=1",
    "hasImage": true,
    "comments": {
      "body": "The true object of education like that of every other moral process is the generation of happiness Happiness to the individual in the first place If individuals were universally happy the species would be happy"
    }
  },
  "NewsApi-Hackaday Podcast 200: Happy New Year, the Ultimate Game Boy, and Python All the Things": {
    "type": "NewsApi",
    "title": "Hackaday Podcast 200: Happy New Year, the Ultimate Game Boy, and Python All the Things",
    "body": "This week, Editor-in-Chief Elliot Williams and Managing Editor Tom Nardi ring in the New Year with…well, pretty much the same stuff they do every other week. After taking some time to talk ab…",
    "url": "https://hackaday.com/2023/01/06/hackaday-podcast-200-happy-new-year-the-ultimate-game-boy-and-python-all-the-things/",
    "urlImage": "https://hackaday.com/wp-content/uploads/2016/05/microphone.jpg",
    "hasImage": true,
    "comments": {
      "body": "This week EditorinChief Elliot Williams and Managing Editor Tom Nardi ring in the New Year withwell pretty much the same stuff they do every other week After taking some time to talk ab"
    }
  },
  "NewsApi-After their baby was killed by a car, parents set out to stop all road deaths": {
    "type": "NewsApi",
    "title": "After their baby was killed by a car, parents set out to stop all road deaths",
    "body": "The Louis Thorold Foundation, which was set up by Rachael and Chris in memory of their son, campaigns for safer roadsLouis Thorold was “just a perfect little baby, smiley and happy”, recalls his father, Chris. One of the five-month-old’s favourite toys was a …",
    "url": "https://www.theguardian.com/world/2023/jan/12/baby-killed-car-parents-road-deaths-louis-thorold-foundation",
    "urlImage": "https://i.guim.co.uk/img/media/b4f9a558e6c5ff585befc591d3aa44b7bfe15e3e/0_112_1284_770/master/1284.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7dd6310d5da568a991d6d70fc39a97a4",
    "hasImage": true,
    "comments": {
      "body": "The Louis Thorold Foundation which was set up by Rachael and Chris in memory of their son campaigns for safer roadsLouis Thorold was just a perfect little baby smiley and happy recalls his father Chris One of the fivemontholds favourite toys was a "
    }
  },
  "NewsApi-‘We’ve lost our fire’: Guardiola rips into Manchester City’s players and fans": {
    "type": "NewsApi",
    "title": "‘We’ve lost our fire’: Guardiola rips into Manchester City’s players and fans",
    "body": "<ul><li>‘We are a happy flowers team. I don’t want this,’ says coach</li><li>Manager unhappy despite 4-2 comeback win against Spurs </li></ul>A scathing Pep Guardiola accused Manchester City of being a “happy flowers” team and lacking the guts and desire to w…",
    "url": "https://www.theguardian.com/football/2023/jan/19/weve-lost-our-fire-pep-guardiola-rips-into-manchester-citys-players-and-fans",
    "urlImage": "https://i.guim.co.uk/img/media/8242d558b715cda00fd006d5eff527ed6e10de70/0_139_2422_1453/master/2422.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0e493214a063a3bf97ddcd1bfed6790f",
    "hasImage": true,
    "comments": {
      "body": "ulliWe are a happy flowers team I dont want this says coachliliManager unhappy despite 42 comeback win against Spurs liulA scathing Pep Guardiola accused Manchester City of being a happy flowers team and lacking the guts and desire to w"
    }
  },
  "NewsApi-Adult Happy Meals, McRib, feed McDonald's sales in Q4": {
    "type": "NewsApi",
    "title": "Adult Happy Meals, McRib, feed McDonald's sales in Q4",
    "body": "Adult Happy Meals and other limited-time promotions boosted traffic at McDonald’s restaurants during the fourth quarter despite higher prices",
    "url": "https://abcnews.go.com/Business/wireStory/adult-happy-meals-mcrib-feed-mcdonalds-sales-q4-96786228",
    "urlImage": "https://s.abcnews.com/images/Business/wirestory_76db0744b64240b5c06149baabaa279a_12x5_992.jpg",
    "hasImage": true,
    "comments": {
      "body": "Adult Happy Meals and other limitedtime promotions boosted traffic at McDonalds restaurants during the fourth quarter despite higher prices"
    }
  },
  "NewsApi-Marjorie Taylor Greene scares Kevin McCarthy into submission: \"I will never leave that woman\"": {
    "type": "NewsApi",
    "title": "Marjorie Taylor Greene scares Kevin McCarthy into submission: \"I will never leave that woman\"",
    "body": "It's a good life for \"Speaker\" Kevin McCarthy, who must think happy thoughts and say happy things, gushing about head honcho Marjorie Taylor Greene at the mere mention of her name. \"I will never leave that woman,\" he told a friend, according to The New York T…",
    "url": "https://boingboing.net/2023/01/23/marjorie-taylor-greene-scares-kevin-mccarthy-into-submission-i-will-never-leave-that-woman.html",
    "urlImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/01/greene-2.jpeg?fit=1200%2C826&ssl=1",
    "hasImage": true,
    "comments": {
      "body": "Its a good life for Speaker Kevin McCarthy who must think happy thoughts and say happy things gushing about head honcho Marjorie Taylor Greene at the mere mention of her name I will never leave that woman he told a friend according to The New York T"
    }
  },
  "NewsApi-Do Not Taunt Happy Fun Branch Predictor": {
    "type": "NewsApi",
    "title": "Do Not Taunt Happy Fun Branch Predictor",
    "body": "Comments",
    "url": "https://www.mattkeeter.com/blog/2023-01-25-branch/",
    "urlImage": null,
    "hasImage": true,
    "comments": {
      "body": "Comments"
    }
  },
  "NewsApi-Generous and selfish": {
    "type": "NewsApi",
    "title": "Generous and selfish",
    "body": "We’re often reminded that the best way to get what we want is to help other people get what they want. That opening the door for others makes it more likely that others will open the door for us. What makes it odd is the implication that if we don’t get, it’s…",
    "url": "https://seths.blog/2023/01/the-odd-generous-selfish-cycle/",
    "urlImage": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806138-1.jpg",
    "hasImage": true,
    "comments": {
      "body": "Were often reminded that the best way to get what we want is to help other people get what they want That opening the door for others makes it more likely that others will open the door for us What makes it odd is the implication that if we dont get its"
    }
  },
  "NewsApi-Triple Zone Clock Tells Time In Style": {
    "type": "NewsApi",
    "title": "Triple Zone Clock Tells Time In Style",
    "body": "Although the cutoff for saying ‘Happy New Year’ is somewhere around today, there’s still plenty of time to reminisce about 2022 and all that we accomplished. Hackaday alum [Jeremy Cook] …read more",
    "url": "https://hackaday.com/2023/01/06/triple-zone-clock-tells-time-in-style/",
    "urlImage": "https://hackaday.com/wp-content/uploads/2023/01/triple-zone-clock-800.jpg",
    "hasImage": true,
    "comments": {
      "body": "Although the cutoff for saying Happy New Year is somewhere around today theres still plenty of time to reminisce about 2022 and all that we accomplished Hackaday alum Jeremy Cook read more"
    }
  },
  "NewsApi-Wormhole Coffee Table Takes Woodworking to Another Dimension": {
    "type": "NewsApi",
    "title": "Wormhole Coffee Table Takes Woodworking to Another Dimension",
    "body": "While some people are happy with a simple coffee table to hold their snacks while watching Star Trek reruns, others want their furniture to go where no furniture has gone before. [Olivier Gomis] ha…",
    "url": "https://hackaday.com/2023/01/20/wormhole-coffee-table-takes-woodworking-to-another-dimension/",
    "urlImage": "https://hackaday.com/wp-content/uploads/2023/01/Wormhole-wide.jpg",
    "hasImage": true,
    "comments": {
      "body": "While some people are happy with a simple coffee table to hold their snacks while watching Star Trek reruns others want their furniture to go where no furniture has gone before Olivier Gomis ha"
    }
  },
  "NewsApi-Handmade GPS Tracker Keeps an Eye on Adventurous Cats": {
    "type": "NewsApi",
    "title": "Handmade GPS Tracker Keeps an Eye on Adventurous Cats",
    "body": "One of the most convenient things about having cats is their independent lifestyle: most are happy to enjoy themselves outside all day, only coming back home when it’s time for dinner and a n…",
    "url": "https://hackaday.com/2023/01/31/handmade-gps-tracker-keeps-an-eye-on-adventurous-cats/",
    "urlImage": "https://hackaday.com/wp-content/uploads/2023/01/Find-My-Cat.jpg",
    "hasImage": true,
    "comments": {
      "body": "One of the most convenient things about having cats is their independent lifestyle most are happy to enjoy themselves outside all day only coming back home when its time for dinner and a n"
    }
  },
  "NewsApi-Boy, 13, drowned in Bedfordshire lake after jumping off rope swing, inquest hears": {
    "type": "NewsApi",
    "title": "Boy, 13, drowned in Bedfordshire lake after jumping off rope swing, inquest hears",
    "body": "Kyron Hibbert, who couldn’t swim, died in Stewartby lake during last summer’s heatwaveA “happy, cheeky, funny, intelligent” 13-year-old boy drowned when he jumped from a rope swing over a lake during last summer’s heatwave, a coroner has heard.Kyron Hibbert, …",
    "url": "https://www.theguardian.com/uk-news/2023/jan/26/boy-13-drowned-in-bedfordshire-lake-after-jumping-off-rope-swing-inquest-hears",
    "urlImage": "https://i.guim.co.uk/img/media/1f9606d482af5ccf5f661aa677d317f83a9e25b6/0_101_1000_600/master/1000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ee968cf12478ba67babc32f56ba95456",
    "hasImage": true,
    "comments": {
      "body": "Kyron Hibbert who couldnt swim died in Stewartby lake during last summers heatwaveA happy cheeky funny intelligent 13yearold boy drowned when he jumped from a rope swing over a lake during last summers heatwave a coroner has heardKyron Hibbert "
    }
  },
  "NewsApi-Paquetá responds to Newcastle’s fast start and salvages point for West Ham": {
    "type": "NewsApi",
    "title": "Paquetá responds to Newcastle’s fast start and salvages point for West Ham",
    "body": "As Declan Rice’s price tag almost certainly increased and Newcastle’s hopes of Champions League qualification receded a little, David Moyes’s grip on the manager’s job at West Ham became a little tighter.Admittedly Moyes is still inching his way back into boa…",
    "url": "https://www.theguardian.com/football/2023/feb/04/paqueta-responds-to-newcastles-fast-start-and-salvages-point-for-west-ham",
    "urlImage": "https://i.guim.co.uk/img/media/f5497e74d890630a920e0408827c2a093c8bf3ff/0_123_2700_1620/master/2700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=352063c71d4f40a2c3bfbd3b2208fbe1",
    "hasImage": true,
    "comments": {
      "body": "As Declan Rices price tag almost certainly increased and Newcastles hopes of Champions League qualification receded a little David Moyess grip on the managers job at West Ham became a little tighterAdmittedly Moyes is still inching his way back into boa"
    }
  },
  "NewsApi-Is it Chinese New Year or Lunar New Year? Depends who you ask": {
    "type": "NewsApi",
    "title": "Is it Chinese New Year or Lunar New Year? Depends who you ask",
    "body": "Last week, K-pop singer Danielle Marsh asked her online fans what they were doing for Chinese New Year. A profuse apology followed two days later, in which she promised to \"try to be more careful\" and acknowledged the \"hurt\" she had caused.",
    "url": "https://www.cnn.com/2023/01/28/asia/chinese-lunar-new-year-controversy-intl-hnk/index.html",
    "urlImage": "https://media.cnn.com/api/v1/images/stellar/prod/230127120024-vietnam-lunar-new-year.jpg?c=16x9&q=w_800,c_fill",
    "hasImage": true,
    "comments": {
      "body": "Last week Kpop singer Danielle Marsh asked her online fans what they were doing for Chinese New Year A profuse apology followed two days later in which she promised to try to be more careful and acknowledged the hurt she had caused"
    }
  },
  "NewsApi-This Cookie Tray Is a Modern Take on What My Mom Used for Lunar New Year — But It’s Just as Auspicious": {
    "type": "NewsApi",
    "title": "This Cookie Tray Is a Modern Take on What My Mom Used for Lunar New Year — But It’s Just as Auspicious",
    "body": "Happy Lunar New Year and happy snacking!\nREAD MORE...",
    "url": "https://www.thekitchn.com/alessi-fatman-folding-cake-stand-review-23497524",
    "urlImage": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FDesign%2F2023-01%2Falessi-fatman-folding-cake-stand-social",
    "hasImage": true,
    "comments": {
      "body": "Happy Lunar New Year and happy snackingREAD MORE"
    }
  },
  "NewsApi-Three Pieces of Good Economic News for the New Year": {
    "type": "NewsApi",
    "title": "Three Pieces of Good Economic News for the New Year",
    "body": "Happy trends are easy to overlook.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/01/new-year-good-news-economy-health-care/672629/?utm_source=feed",
    "urlImage": null,
    "hasImage": true,
    "comments": {
      "body": "Happy trends are easy to overlook"
    }
  },
  "NewsApi-'Laverne & Shirley' star Cindy Williams dead at 75": {
    "type": "NewsApi",
    "title": "'Laverne & Shirley' star Cindy Williams dead at 75",
    "body": "Cindy Williams, the dynamic actress known best for playing the bubbly Shirley Feeney on the beloved sitcom \"Laverne & Shirley,\" has died, according to a statement from her family, provided to CNN by a representative. She was 75.",
    "url": "https://www.cnn.com/2023/01/30/entertainment/cindy-williams-dead/index.html",
    "urlImage": "https://media.cnn.com/api/v1/images/stellar/prod/230130191321-cindy-williams-2015-file.jpg?c=16x9&q=w_800,c_fill",
    "hasImage": true,
    "comments": {
      "body": "Cindy Williams the dynamic actress known best for playing the bubbly Shirley Feeney on the beloved sitcom Laverne  Shirley has died according to a statement from her family provided to CNN by a representative She was 75"
    }
  },
  "NewsApi-Call Of Duty’s Next Season Undoes What People Hated About Warzone 2.0": {
    "type": "NewsApi",
    "title": "Call Of Duty’s Next Season Undoes What People Hated About Warzone 2.0",
    "body": "Season two for Call of Duty’s Modern Warfare II multiplayer and Warzone 2.0 arrives on February 15. An official blog from yesterday details the many changes we can expect for the game’s various modes, some of which ought to make fans of the original Warzone v…",
    "url": "https://kotaku.com/call-of-duty-wz2-mw2-warzone-season-2-gulag-1v1-1850034756",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/6d5106b758928cae10ac3e1a4d44408f.jpg",
    "hasImage": true,
    "comments": {
      "body": "Season two for Call of Dutys Modern Warfare II multiplayer and Warzone 20 arrives on February 15 An official blog from yesterday details the many changes we can expect for the games various modes some of which ought to make fans of the original Warzone v"
    }
  },
  "NewsApi-How to Be Single and Happy": {
    "type": "NewsApi",
    "title": "How to Be Single and Happy",
    "body": "Have you recently broken up with a significant other and find yourself struggling to be happy? Or maybe you’ve been single too long and feel like you’ll never be happy until you find your soulmate? It might seem like you’ll never be able to be happy and singl…",
    "url": "https://www.wikihow.com/Be-Single-and-Happy",
    "urlImage": "https://www.wikihow.com/images/0/0f/Be-Single-and-Happy-Step-12-Version-3.jpg",
    "hasImage": true,
    "comments": {
      "body": "Have you recently broken up with a significant other and find yourself struggling to be happy Or maybe youve been single too long and feel like youll never be happy until you find your soulmate It might seem like youll never be able to be happy and singl"
    }
  },
  "NewsApi-Why Aren't You Happy, Even When You Get What You Want? This Founder Teamed Up With the Dalai Lama Himself to Cure Your 'Insatiable' Desire.": {
    "type": "NewsApi",
    "title": "Why Aren't You Happy, Even When You Get What You Want? This Founder Teamed Up With the Dalai Lama Himself to Cure Your 'Insatiable' Desire.",
    "body": "Ten Percent Happier founder Dan Harris traveled to India to partner with Tibet's highest spiritual leader on a free program that will help you cultivate a compassionate mindset.",
    "url": "https://www.entrepreneur.com/living/want-to-be-happy-this-founder-and-the-dalai-lama-can-help/443031",
    "urlImage": "https://assets.entrepreneur.com/content/3x2/2000/1673899933-ten-percent-happier-dalaiLama-illustrations-20221214-RAW.jpg",
    "hasImage": true,
    "comments": {
      "body": "Ten Percent Happier founder Dan Harris traveled to India to partner with Tibets highest spiritual leader on a free program that will help you cultivate a compassionate mindset"
    }
  },
  "NewsApi-Chaos breaks out on a plane when 15 passengers all fight each other (video)": {
    "type": "NewsApi",
    "title": "Chaos breaks out on a plane when 15 passengers all fight each other (video)",
    "body": "Sometimes, when it comes to airplane travel, not everybody is happy with their seat. Such was the case yesterday when a serious brawl broke out on a domestic Brazilian Gol Airlines flight between 15 passengers. Even a few flight attendants were seen in the mi…",
    "url": "https://boingboing.net/2023/02/03/chaos-breaks-out-on-a-plane-when-15-passengers-fight-each-other-video.html",
    "urlImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/02/gol.jpeg?fit=1200%2C900&ssl=1",
    "hasImage": true,
    "comments": {
      "body": "Sometimes when it comes to airplane travel not everybody is happy with their seat Such was the case yesterday when a serious brawl broke out on a domestic Brazilian Gol Airlines flight between 15 passengers Even a few flight attendants were seen in the mi"
    }
  },
  "NewsApi-Malo Gusto: Chelsea sign teenage right-back from Lyon in £31m deal": {
    "type": "NewsApi",
    "title": "Malo Gusto: Chelsea sign teenage right-back from Lyon in £31m deal",
    "body": "Chelsea sign 19-year-old French right-back Malo Gusto from Lyon in a deal worth 35m euro (£30.7m).",
    "url": "https://www.bbc.co.uk/sport/football/64444185",
    "urlImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/46B9/production/_128450181_gettyimages-1440924035.jpg",
    "hasImage": true,
    "comments": {
      "body": "Chelsea sign 19yearold French rightback Malo Gusto from Lyon in a deal worth 35m euro 307m"
    }
  },
  "NewsApi-West Ham: David Moyes says club have 'no intention' of selling Michail Antonio": {
    "type": "NewsApi",
    "title": "West Ham: David Moyes says club have 'no intention' of selling Michail Antonio",
    "body": "West Ham have \"no intention\" of selling striker Michail Antonio despite the player saying he is talking to other clubs, says manager David Moyes.",
    "url": "https://www.bbc.co.uk/sport/football/64431460",
    "urlImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/0AF4/production/_128440820_gettyimages-1246081112.jpg",
    "hasImage": true,
    "comments": {
      "body": "West Ham have no intention of selling striker Michail Antonio despite the player saying he is talking to other clubs says manager David Moyes"
    }
  },
  "NewsApi-Christie Brinkley, 68, displays her youthful legs in Turks and Caicos: 'May 2023 be full of happy days’": {
    "type": "NewsApi",
    "title": "Christie Brinkley, 68, displays her youthful legs in Turks and Caicos: 'May 2023 be full of happy days’",
    "body": "Christie Brinkley appeared in Sports Illustrated Swimsuit eight times between 1975 to 2004. She earned three consecutive covers in 1979, 1980 and 1981.",
    "url": "https://news.yahoo.com/christie-brinkley-68-displays-her-154924347.html",
    "urlImage": "https://media.zenfs.com/en/fox_news_text_979/d597ad6294dde38cbddae0bfd4a466c7",
    "hasImage": true,
    "comments": {
      "body": "Christie Brinkley appeared in Sports Illustrated Swimsuit eight times between 1975 to 2004 She earned three consecutive covers in 1979 1980 and 1981"
    }
  },
  "NewsApi-Who Is More Important — Your Customers or Your Employees?": {
    "type": "NewsApi",
    "title": "Who Is More Important — Your Customers or Your Employees?",
    "body": "Business owners will succeed when they create an environment where employees want to work, and customers want to transact.",
    "url": "https://www.entrepreneur.com/leadership/the-customer-or-employee-who-is-more-important/443930",
    "urlImage": "https://assets.entrepreneur.com/content/3x2/2000/1675114981-shutterstock-1477775291.jpg",
    "hasImage": true,
    "comments": {
      "body": "Business owners will succeed when they create an environment where employees want to work and customers want to transact"
    }
  },
  "NewsApi-Kane a doubt for Tottenham in FA Cup - Reuters": {
    "type": "NewsApi",
    "title": "Kane a doubt for Tottenham in FA Cup - Reuters",
    "body": "Harry Kane may have to wait at least another week to become Tottenham Hotspur's all-time record goalscorer as illness could rule him out of Saturday's FA Cup fourth round tie away at Preston North End.",
    "url": "https://www.reuters.com/lifestyle/sports/kane-doubt-tottenham-fa-cup-2023-01-27/",
    "urlImage": "https://www.reuters.com/resizer/aF8uYUvO6x7BEsa-grp2-6vZNEU=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/4YOZBOO7BVIWZLEVMXUB3AE4OY.jpg",
    "hasImage": true,
    "comments": {
      "body": "Harry Kane may have to wait at least another week to become Tottenham Hotspurs alltime record goalscorer as illness could rule him out of Saturdays FA Cup fourth round tie away at Preston North End"
    }
  },
  "NewsApi-Korda retires to send Khachanov into Australian Open semis ... - Reuters": {
    "type": "NewsApi",
    "title": "Korda retires to send Khachanov into Australian Open semis ... - Reuters",
    "body": "Karen Khachanov reached the Australian Open semi-finals for the first time on Tuesday after Sebastian Korda retired injured while trailing 7-6(5) 6-3 3-0, dashing the American's hopes of emulating his father Petr's 1998 Melbourne Park triumph.",
    "url": "https://www.reuters.com/lifestyle/sports/korda-retires-send-khachanov-into-australian-open-semis-rybakina-through-2023-01-24/",
    "urlImage": "https://www.reuters.com/resizer/GFk2e2y7za_ocvvowvy0BsVHtxY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/5QUKSC3J3JOK7IT7C7FAIYSJDQ.jpg",
    "hasImage": true,
    "comments": {
      "body": "Karen Khachanov reached the Australian Open semifinals for the first time on Tuesday after Sebastian Korda retired injured while trailing 765 63 30 dashing the Americans hopes of emulating his father Petrs 1998 Melbourne Park triumph"
    }
  },
  "NewsApi-Monthly Horoscope: Aquarius, February 2023": {
    "type": "NewsApi",
    "title": "Monthly Horoscope: Aquarius, February 2023",
    "body": "Happy solar return, dear Aquarius!",
    "url": "https://www.vice.com/en/article/jgp7eg/monthly-horoscope-aquarius-february-2023",
    "urlImage": "https://video-images.vice.com/articles/63cec9de117d758193b93037/lede/1675257098129-11aquariuspiscesmonthly131920x1080.jpeg?image-resize-opts=Y3JvcD0xeHc6MXhoO2NlbnRlcixjZW50ZXImcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq",
    "hasImage": true,
    "comments": {
      "body": "Happy solar return dear Aquarius"
    }
  },
  "NewsApi-Razer’s Cage-Like Mouse Is a $280 Goth-Metal Jewel": {
    "type": "NewsApi",
    "title": "Razer’s Cage-Like Mouse Is a $280 Goth-Metal Jewel",
    "body": "Plus: Twitter squeezes more money out of its users, AI ain’t stopping anytime soon, and Samsung hypes new phones in an era of decreasing sales.",
    "url": "https://www.wired.com/story/razer-viper-mini-mouse-goth-metal/",
    "urlImage": "https://media.wired.com/photos/63dd59aa87ce3c85533f0f99/191:100/w_1280,c_limit/Razer-Viper-Mini-Gear-Roundup-Gear.jpg",
    "hasImage": true,
    "comments": {
      "body": "Plus Twitter squeezes more money out of its users AI aint stopping anytime soon and Samsung hypes new phones in an era of decreasing sales"
    }
  },
  "NewsApi-Julian Sands: Family thanks California authorities for 'heroic' search": {
    "type": "NewsApi",
    "title": "Julian Sands: Family thanks California authorities for 'heroic' search",
    "body": "The British actor went missing on 13 January during a mountain hike near Los Angeles.",
    "url": "https://www.bbc.co.uk/news/world-64381921",
    "urlImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10BA7/production/_128391586_993a841ed596451c60e8e699ab4e69045296f438.jpg",
    "hasImage": true,
    "comments": {
      "body": "The British actor went missing on 13 January during a mountain hike near Los Angeles"
    }
  },
  "NewsApi-You can see why Harry dislikes the tabloid press – but they didn’t cause Diana’s death": {
    "type": "NewsApi",
    "title": "You can see why Harry dislikes the tabloid press – but they didn’t cause Diana’s death",
    "body": "The Duke of Sussex was wrong to say in his ITV interview that his mother died as a direct result of the paparazzi’s actionsWatching Prince Harry emoting to interviewer Tom Bradby for more than an hour and 40 minutes it was impossible not to feel sympathy. Hap…",
    "url": "https://www.theguardian.com/uk-news/2023/jan/09/you-can-see-why-prince-harry-dislikes-the-tabloid-press-but-they-didnt-cause-dianas-death",
    "urlImage": "https://i.guim.co.uk/img/media/05130b70b35203e67e9cee633836e696ab14c7c7/120_0_3531_2121/master/3531.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c2218d4c4d61d1c28ac439c811453377",
    "hasImage": true,
    "comments": {
      "body": "The Duke of Sussex was wrong to say in his ITV interview that his mother died as a direct result of the paparazzis actionsWatching Prince Harry emoting to interviewer Tom Bradby for more than an hour and 40 minutes it was impossible not to feel sympathy Hap"
    }
  },
  "NewsApi-Experience: I almost died while pole dancing": {
    "type": "NewsApi",
    "title": "Experience: I almost died while pole dancing",
    "body": "I loved the sport until disaster struck. Paralysed from the neck down, I vowed to recover my mobility and get back on the poleI started pole dancing in 2015. It’s my happy place, and makes me feel free and empowered. But the sport I adore so much nearly cost …",
    "url": "https://www.theguardian.com/lifeandstyle/2023/jan/27/experience-i-almost-died-while-pole-dancing",
    "urlImage": "https://i.guim.co.uk/img/media/a310edfaf49d142003eaf952a3147fce79476fd7/0_223_6694_4017/master/6694.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6b931a0a2da8176009c984a7214757a9",
    "hasImage": true,
    "comments": {
      "body": "I loved the sport until disaster struck Paralysed from the neck down I vowed to recover my mobility and get back on the poleI started pole dancing in 2015 Its my happy place and makes me feel free and empowered But the sport I adore so much nearly cost "
    }
  },
  "NewsApi-‘Patients were chained to walls and beds’: Freetown’s psychiatric hospital released from the past": {
    "type": "NewsApi",
    "title": "‘Patients were chained to walls and beds’: Freetown’s psychiatric hospital released from the past",
    "body": "The Sierra Leone capital’s colonial-era asylum has modernised, offering psychotherapy, yoga and basketball as well as drugs – and has thrown away its shacklesHis family had accused him of being a demon, Abubakarr Jallou tells a group of patients gathered in a…",
    "url": "https://www.theguardian.com/global-development/2023/jan/17/patients-chained-to-walls-and-beds-freetown-sierra-leone-psychiatric-hospital",
    "urlImage": "https://i.guim.co.uk/img/media/86d1c250c65103fc1f68a23718e048b52d021c3e/1592_825_2801_1681/master/2801.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aef7c65be6fe152387b859de04f0ea10",
    "hasImage": true,
    "comments": {
      "body": "The Sierra Leone capitals colonialera asylum has modernised offering psychotherapy yoga and basketball as well as drugs  and has thrown away its shacklesHis family had accused him of being a demon Abubakarr Jallou tells a group of patients gathered in a"
    }
  },
  "NewsApi-José Pizarro’s recipe for black beans with ham hock and cabbage": {
    "type": "NewsApi",
    "title": "José Pizarro’s recipe for black beans with ham hock and cabbage",
    "body": "Black beans in a warming Basque stew of cabbage and ham hock: happy JanuaryI love British winters, and being outside on crisp, cold days, as well as steaming up at indoor parties. Although people say January is the deepest, darkest month, we have incredible w…",
    "url": "https://www.theguardian.com/food/2023/jan/14/jose-pizarro-recipe-black-beans-ham-hock-cabbage",
    "urlImage": "https://i.guim.co.uk/img/media/15de99754026c0673437871dda8ae65bb46dda05/588_2178_4845_2907/master/4845.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2eb0751bf1ce174da3413fc66e711146",
    "hasImage": true,
    "comments": {
      "body": "Black beans in a warming Basque stew of cabbage and ham hock happy JanuaryI love British winters and being outside on crisp cold days as well as steaming up at indoor parties Although people say January is the deepest darkest month we have incredible w"
    }
  },
  "NewsApi-Sunday with Prue Leith: ‘I’m quite partial to a siesta’": {
    "type": "NewsApi",
    "title": "Sunday with Prue Leith: ‘I’m quite partial to a siesta’",
    "body": "The chef talks about not eating in the morning, a doze in the afternoon, and why she doesn’t like watching Bake OffWhat’s for breakfast? I try not to eat until lunchtime, because I’m so greedy and I get fat so easily.What then? We often have the family over. …",
    "url": "https://www.theguardian.com/lifeandstyle/2023/jan/29/sunday-with-prue-leith-im-quite-partial-to-a-siesta",
    "urlImage": "https://i.guim.co.uk/img/media/c24dfa8c20ca500a85ce9cfba86289ea1667cd7a/0_564_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=b9f939970885c673e087b13baac48197",
    "hasImage": true,
    "comments": {
      "body": "The chef talks about not eating in the morning a doze in the afternoon and why she doesnt like watching Bake OffWhats for breakfast I try not to eat until lunchtime because Im so greedy and I get fat so easilyWhat then We often have the family over "
    }
  },
  "NewsApi-Dallas Zoo Is Offering a $25,000 Reward for Information on Who Stole Its Monkeys": {
    "type": "NewsApi",
    "title": "Dallas Zoo Is Offering a $25,000 Reward for Information on Who Stole Its Monkeys",
    "body": "Dallas Zoo officials set the internet at ease this week when they shared that their two missing emperor tamarin monkeys had been found safe and unharmed by police one day after they were taken. The story isn’t done yet, though. The Dallas Zoo wants justice, a…",
    "url": "https://gizmodo.com/dallas-zoo-25000-reward-stolen-monkeys-torn-enclosures-1850063763",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/54a7e046a06cc40d9e03bb9e36d9eb8b.png",
    "hasImage": true,
    "comments": {
      "body": "Dallas Zoo officials set the internet at ease this week when they shared that their two missing emperor tamarin monkeys had been found safe and unharmed by police one day after they were taken The story isnt done yet though The Dallas Zoo wants justice a"
    }
  },
  "NewsApi-Court dramas allow Australian Open to overrule controversies": {
    "type": "NewsApi",
    "title": "Court dramas allow Australian Open to overrule controversies",
    "body": "Two worthy champions in Djokovic and Sabalenka plus Murray’s heroics helped make it a Happy Slam againAnother Australian Open is in the books with worthy champions crowned, new names welcomed to the top level and record crowds having enjoyed the first grand s…",
    "url": "https://www.theguardian.com/sport/2023/jan/30/court-drama-australian-open-tennis-overrule-controversies-djokovic-sabalenka-murray",
    "urlImage": "https://i.guim.co.uk/img/media/29a8f075d123713800b110a9a1df87ad16029f77/0_184_4266_2560/master/4266.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=31ef1f3d1f6383385451035cf239dedf",
    "hasImage": true,
    "comments": {
      "body": "Two worthy champions in Djokovic and Sabalenka plus Murrays heroics helped make it a Happy Slam againAnother Australian Open is in the books with worthy champions crowned new names welcomed to the top level and record crowds having enjoyed the first grand s"
    }
  },
  "NewsApi-Kilde wins in Kitzbuehel as Feuz says farewell - Reuters.com": {
    "type": "NewsApi",
    "title": "Kilde wins in Kitzbuehel as Feuz says farewell - Reuters.com",
    "body": "Norwegian skier Aleksander Aamodt Kilde won a men's World Cup downhill on Kitzbuehel's fearsome Hahnenkamm slope on Saturday as Switzerland's Olympic champion Beat Feuz headed into retirement.",
    "url": "https://www.reuters.com/lifestyle/sports/kilde-wins-kitzbuehel-feuz-says-farewell-2023-01-21/",
    "urlImage": "https://www.reuters.com/resizer/gpfwOSg3-wa0YgI1Doxe0p40g-s=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/XGIWTZEYTJM23EZCDK36KK6LHY.jpg",
    "hasImage": true,
    "comments": {
      "body": "Norwegian skier Aleksander Aamodt Kilde won a mens World Cup downhill on Kitzbuehels fearsome Hahnenkamm slope on Saturday as Switzerlands Olympic champion Beat Feuz headed into retirement"
    }
  },
  "NewsApi-Pioli takes responsibility for Milan winless run - Reuters": {
    "type": "NewsApi",
    "title": "Pioli takes responsibility for Milan winless run - Reuters",
    "body": "AC Milan coach Stefano Pioli said on Saturday that he took responsibility for the club's recent winless run but believed they can turn their fortunes around with the resources they have.",
    "url": "https://www.reuters.com/lifestyle/sports/pioli-takes-responsibility-milan-winless-run-2023-01-28/",
    "urlImage": "https://www.reuters.com/resizer/iVIUhzHFqO4KCJEb04G0HvYsQ7o=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/DX2MFURMOBLZXL3E6ACQ5EYEHU.jpg",
    "hasImage": true,
    "comments": {
      "body": "AC Milan coach Stefano Pioli said on Saturday that he took responsibility for the clubs recent winless run but believed they can turn their fortunes around with the resources they have"
    }
  },
  "NewsApi-Medvedev downs Kecmanovic to reach Adelaide quarters - Reuters": {
    "type": "NewsApi",
    "title": "Medvedev downs Kecmanovic to reach Adelaide quarters - Reuters",
    "body": "Daniil Medvedev reached the Adelaide International 1 quarter-finals with a 6-0 6-3 win over Miomir Kecmanovic on Wednesday, moving a step closer to a potential semi-final showdown with Novak Djokovic at the Australian Open warm-up event.",
    "url": "https://www.reuters.com/lifestyle/sports/medvedev-downs-kecmanovic-reach-adelaide-quarters-2023-01-04/",
    "urlImage": "https://www.reuters.com/resizer/orrfda6TZ6ED8ejhCroYNLgRgY8=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/6BBVLHKQNBLK3MTQFW6BG3ACDU.jpg",
    "hasImage": true,
    "comments": {
      "body": "Daniil Medvedev reached the Adelaide International 1 quarterfinals with a 60 63 win over Miomir Kecmanovic on Wednesday moving a step closer to a potential semifinal showdown with Novak Djokovic at the Australian Open warmup event"
    }
  },
  "NewsApi-Charlotte Higgins on The Archers: logging and dogging as Ambridge gets X-rated": {
    "type": "NewsApi",
    "title": "Charlotte Higgins on The Archers: logging and dogging as Ambridge gets X-rated",
    "body": "Will Borsetshire’s ace sleuths Rex and Kirsty be able to crack the mystery of the illicit hanky panky in the woods?As Happy Valley returns to the BBC, I’m put in mind of the final episode of the second season of that work of televisual genius. Sgt Catherine C…",
    "url": "https://www.theguardian.com/tv-and-radio/2023/jan/10/charlotte-higgins-on-the-archers-logging-and-dogging-as-ambridge-gets-x-rated",
    "urlImage": "https://i.guim.co.uk/img/media/74db0c44eda20ee6efc3d685790b1960ac088274/0_19_3798_2279/master/3798.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2b8aa83fcae9595c092ff6e5681ab692",
    "hasImage": true,
    "comments": {
      "body": "Will Borsetshires ace sleuths Rex and Kirsty be able to crack the mystery of the illicit hanky panky in the woodsAs Happy Valley returns to the BBC Im put in mind of the final episode of the second season of that work of televisual genius Sgt Catherine C"
    }
  },
  "NewsApi-Brittney Griner makes surprise appearance at MLK Day event": {
    "type": "NewsApi",
    "title": "Brittney Griner makes surprise appearance at MLK Day event",
    "body": "It was the basketball star's first public appearance since her release from a Russian penal colony.",
    "url": "https://www.bbc.co.uk/news/world-us-canada-64309355",
    "urlImage": "https://ichef.bbci.co.uk/news/1024/branded_news/DD56/production/_128326665_gettyimages-1345616011.jpg",
    "hasImage": true,
    "comments": {
      "body": "It was the basketball stars first public appearance since her release from a Russian penal colony"
    }
  },
  "NewsApi-Syria camps: Canada to repatriate 23 citizens": {
    "type": "NewsApi",
    "title": "Syria camps: Canada to repatriate 23 citizens",
    "body": "British-Canadian dual national Jack Letts is among the people who will return to Canada from Syria.",
    "url": "https://www.bbc.co.uk/news/world-us-canada-64358044",
    "urlImage": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png",
    "hasImage": true,
    "comments": {
      "body": "BritishCanadian dual national Jack Letts is among the people who will return to Canada from Syria"
    }
  },
  "NewsApi-Tennis : aux antipodes des autres tournois du Grand Chelem, l’Open d’Australie cultive la décontraction": {
    "type": "NewsApi",
    "title": "Tennis : aux antipodes des autres tournois du Grand Chelem, l’Open d’Australie cultive la décontraction",
    "body": "Moins exubérant que l’US Open mais loin du très feutré Wimbledon, le tournoi de Melbourne, surnommé « happy slam », fait figure de joyeuse kermesse.",
    "url": "https://www.lemonde.fr/sport/article/2023/01/20/tennis-aux-antipodes-des-autres-tournois-du-grand-chelem-l-open-d-australie-cultive-la-decontraction_6158656_3242.html",
    "urlImage": "https://img.lemde.fr/2023/01/20/0/0/7357/4904/1440/960/60/0/382188c_89eee90911cc48c3b30e95a18eb1815b-0-6bd44523a40a48619a61456dbf149ab0.jpg",
    "hasImage": true,
    "comments": {
      "body": "Moins exubérant que lUS Open mais loin du très feutré Wimbledon le tournoi de Melbourne surnommé happy slam fait figure de joyeuse kermesse"
    }
  },
  "NewsApi-China reopens borders in final farewell to zero-COVID - Reuters.com": {
    "type": "NewsApi",
    "title": "China reopens borders in final farewell to zero-COVID - Reuters.com",
    "body": "Travellers began streaming across land and sea crossings from Hong Kong to mainland China on Sunday, many eager for long-awaited reunions, as Beijing opened borders that have been all but shut since the start of the COVID-19 pandemic.",
    "url": "https://www.reuters.com/world/china/china-reopens-borders-final-farewell-zero-covid-2023-01-08/",
    "urlImage": "https://www.reuters.com/resizer/eZkR6lXvjY68Qx8e3_KR7RNJ2OA=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/TI3JYBMSTRL4ZPEFDBVMVJ2HZI.jpg",
    "hasImage": true,
    "comments": {
      "body": "Travellers began streaming across land and sea crossings from Hong Kong to mainland China on Sunday many eager for longawaited reunions as Beijing opened borders that have been all but shut since the start of the COVID19 pandemic"
    }
  },
  "NewsApi-Swiatek into third round indoors as rain stops play outside - Reuters": {
    "type": "NewsApi",
    "title": "Swiatek into third round indoors as rain stops play outside - Reuters",
    "body": "Iga Swiatek, hot favourite for the women's title, and men's dark horse Jannik Sinner swept into the third round of the Australian Open before nine first-round matches were started as the weather continued to wreak havoc at Melbourne Park on Wednesday.",
    "url": "https://www.reuters.com/lifestyle/sports/swiatek-into-third-round-indoors-rain-stops-play-outside-2023-01-18/",
    "urlImage": "https://www.reuters.com/resizer/kF_rqBAzI7GKm25St7qMfOueRUs=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/QOS6V5X7OJL7FCWF33RNT3US5M.jpg",
    "hasImage": true,
    "comments": {
      "body": "Iga Swiatek hot favourite for the womens title and mens dark horse Jannik Sinner swept into the third round of the Australian Open before nine firstround matches were started as the weather continued to wreak havoc at Melbourne Park on Wednesday"
    }
  },
  "NewsApi-How to Shop for Tech That Actually Lasts": {
    "type": "NewsApi",
    "title": "How to Shop for Tech That Actually Lasts",
    "body": "All the tech we know and love will, one day, be obsolete. In the meantime, it would be nice if the gadgets we use every day were designed to last longer and longer rather than shorter and shorter. Unfortunately, tech companies usually adopt the strategy of “p…",
    "url": "https://lifehacker.com/how-to-shop-for-tech-that-actually-lasts-1850001386",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/95fe59b05c00616c4c940de73290c910.jpg",
    "hasImage": true,
    "comments": {
      "body": "All the tech we know and love will one day be obsolete In the meantime it would be nice if the gadgets we use every day were designed to last longer and longer rather than shorter and shorter Unfortunately tech companies usually adopt the strategy of p"
    }
  },
  "NewsApi-Vasektomie: Happy V-Day": {
    "type": "NewsApi",
    "title": "Vasektomie: Happy V-Day",
    "body": "Immer mehr Männer entschließen sich zu einer Vasektomie. Doch nicht jeder mag an sich herumschneiden lassen. Und die wenigsten wissen, was dabei genau passiert.",
    "url": "https://www.zeit.de/zustimmung?url=https%3A%2F%2Fwww.zeit.de%2Fzeit-magazin%2Ffamilie%2F2023-01%2Fvasektomie-maenner-verhuetung-urologie",
    "urlImage": null,
    "hasImage": true,
    "comments": {
      "body": "Immer mehr Männer entschließen sich zu einer Vasektomie Doch nicht jeder mag an sich herumschneiden lassen Und die wenigsten wissen was dabei genau passiert"
    }
  }
}