{
  "NewsApi-Rare Polar Bear Attack in Canada | Extreme Earth": {
    "type": "NewsApi",
    "title": "Rare Polar Bear Attack in Canada | Extreme Earth",
    "body": "Climate change is depleting sea ice in the Arctic, increasing chances of human and polar bear encounters.",
    "url": "https://gizmodo.com/rare-polar-bear-attack-in-canada-extreme-earth-1850041161",
    "urlImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/652669cc8dd7c1c10e930eeb094a3843.jpg",
    "hasImage": true,
    "comments": {
      "body": "Climate change is depleting sea ice in the Arctic increasing chances of human and polar bear encounters"
    }
  },
  "NewsApi-Syria camps: Canada to repatriate 23 citizens": {
    "type": "NewsApi",
    "title": "Syria camps: Canada to repatriate 23 citizens",
    "body": "British-Canadian dual national Jack Letts is among the people who will return to Canada from Syria.",
    "url": "https://www.bbc.co.uk/news/world-us-canada-64358044",
    "urlImage": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png",
    "hasImage": true,
    "comments": {
      "body": "BritishCanadian dual national Jack Letts is among the people who will return to Canada from Syria"
    }
  },
  "NewsApi-Mexican President pledged to work closely with Canada on energy ... - Reuters Canada": {
    "type": "NewsApi",
    "title": "Mexican President pledged to work closely with Canada on energy ... - Reuters Canada",
    "body": "Mexican President Andres Manuel Lopez Obrador pledged to work closely with Canada to ensure energy sector reforms were beneficial for both countries, Canadian Prime Minister Justin Trudeau said on Wednesday.",
    "url": "https://www.reuters.com/world/americas/mexican-president-pledged-work-closely-with-canada-energy-issues-trudeau-2023-01-11/",
    "urlImage": "https://www.reuters.com/resizer/gD6xN8bu9LYIaLguKKrxtsSek1c=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/2HMMEOTYQ5KRFG2TGXVR36HZQ4.jpg",
    "hasImage": true,
    "comments": {
      "body": "Mexican President Andres Manuel Lopez Obrador pledged to work closely with Canada to ensure energy sector reforms were beneficial for both countries Canadian Prime Minister Justin Trudeau said on Wednesday"
    }
  },
  "NewsApi-Canada economy grew 0.1% in November, most likely flat in ... - Reuters Canada": {
    "type": "NewsApi",
    "title": "Canada economy grew 0.1% in November, most likely flat in ... - Reuters Canada",
    "body": "OTTAWA, Jan 31 (Reuters) - The Canadian economy grew by 0.1% in November, mostly on services-producing industries, Statistics Canada said on Tuesday. December GDP was most likely unchanged, while real industry GDP looks to increase by 0.4% in the fourth quart…",
    "url": "https://www.reuters.com/world/americas/canada-economy-grew-01-november-most-likely-flat-december-2023-01-31/",
    "urlImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=127",
    "hasImage": true,
    "comments": {
      "body": "OTTAWA Jan 31 Reuters  The Canadian economy grew by 01 in November mostly on servicesproducing industries Statistics Canada said on Tuesday December GDP was most likely unchanged while real industry GDP looks to increase by 04 in the fourth quart"
    }
  },
  "NewsApi-Canada moves to extend exclusion of mental illness from assisted ... - Reuters Canada": {
    "type": "NewsApi",
    "title": "Canada moves to extend exclusion of mental illness from assisted ... - Reuters Canada",
    "body": "Canada's federal government on Thursday moved to extend by a year its exclusion of people suffering solely from mental illness from the country's assisted death framework.",
    "url": "https://www.reuters.com/world/americas/canada-moves-extend-exclusion-mental-illness-assisted-death-2023-02-02/",
    "urlImage": "https://www.reuters.com/resizer/Z-Zu6_Rpkhg4_Crllwjy5tm1Fs8=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/TGBQI3UQ6RKP5KUI6JTZOCANMU.jpg",
    "hasImage": true,
    "comments": {
      "body": "Canadas federal government on Thursday moved to extend by a year its exclusion of people suffering solely from mental illness from the countrys assisted death framework"
    }
  },
  "NewsApi-Canada appoints First Nations member to Bank of Canada board - Reuters": {
    "type": "NewsApi",
    "title": "Canada appoints First Nations member to Bank of Canada board - Reuters",
    "body": "The Canadian government filled three Bank of Canada board vacancies on Thursday with finance veterans including Ernie Daniels, likely the first First Nations member on the central bank's board, a bank spokesperson said.",
    "url": "https://www.reuters.com/business/finance/canada-appoints-first-nations-member-bank-canada-board-2023-01-12/",
    "urlImage": "https://www.reuters.com/resizer/Ipb761qsKfERbSOoSYWsqnMtSHo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/MMJZE2FBOFNXBGBWOQ6WPEREBY.jpg",
    "hasImage": true,
    "comments": {
      "body": "The Canadian government filled three Bank of Canada board vacancies on Thursday with finance veterans including Ernie Daniels likely the first First Nations member on the central banks board a bank spokesperson said"
    }
  },
  "NewsApi-Biden to focus on fentanyl in Mexico, Canada talks - Reuters Canada": {
    "type": "NewsApi",
    "title": "Biden to focus on fentanyl in Mexico, Canada talks - Reuters Canada",
    "body": "President Joe Biden hopes to focus on the flow of fentanyl into the United States during a Mexico City meeting with leaders from Mexico and Canada next week, National Security Council spokesman John Kirby told reporters in the White House on Friday.",
    "url": "https://www.reuters.com/world/americas/biden-focus-fentanyl-mexico-canada-talks-2023-01-06/",
    "urlImage": "https://www.reuters.com/resizer/es7Eo_f8qGIWB0-Hc-iFINwMG9g=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/IWJ7LRA7IJLBHOTIQN642YCWAM.jpg",
    "hasImage": true,
    "comments": {
      "body": "President Joe Biden hopes to focus on the flow of fentanyl into the United States during a Mexico City meeting with leaders from Mexico and Canada next week National Security Council spokesman John Kirby told reporters in the White House on Friday"
    }
  },
  "NewsApi-Canada disappointed by U.S. plan to maintain softwood lumber duties - Reuters Canada": {
    "type": "NewsApi",
    "title": "Canada disappointed by U.S. plan to maintain softwood lumber duties - Reuters Canada",
    "body": "Canada is disappointed the United States plans to maintain tariffs on Canadian softwood lumber imports, Ottawa said on Tuesday, arguing that a negotiated solution to the longstanding dispute was in the best interests of both countries.",
    "url": "https://www.reuters.com/world/americas/canada-disappointed-by-us-plan-maintain-softwood-lumber-duties-2023-01-24/",
    "urlImage": "https://www.reuters.com/resizer/ewvfsxPNENg2uoEqB-CY76GTz3g=/800x419/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/PUCES3W4XRLFXJNQKYU5A2WVLY.jpg",
    "hasImage": true,
    "comments": {
      "body": "Canada is disappointed the United States plans to maintain tariffs on Canadian softwood lumber imports Ottawa said on Tuesday arguing that a negotiated solution to the longstanding dispute was in the best interests of both countries"
    }
  },
  "NewsApi-Riots at the Brazil capital - Reuters Canada": {
    "type": "NewsApi",
    "title": "Riots at the Brazil capital - Reuters Canada",
    "body": "Riots at the Brazil capital  Reuters Canada",
    "url": "https://www.reuters.com/graphics/BRAZIL-POLITICS/RIOTS/gkplwxqggvb/",
    "urlImage": "https://www.reuters.com/graphics/BRAZIL-POLITICS/RIOTS/gkplwxqggvb/cdn/images/share-card.jpg",
    "hasImage": true,
    "comments": {
      "body": "Riots at the Brazil capitalReuters Canada"
    }
  },
  "NewsApi-Canada posts C$41 mln Nov trade deficit on lower energy exports - Reuters": {
    "type": "NewsApi",
    "title": "Canada posts C$41 mln Nov trade deficit on lower energy exports - Reuters",
    "body": "Canada posted a trade deficit of C$41 million ($30.32 million) in November, driven by lower exports of energy products, with both imports and exports affected by the appreciation of the Canadian dollar, Statistics Canada said on Thursday.",
    "url": "https://www.reuters.com/business/canada-posts-c41-mln-nov-trade-deficit-lower-energy-exports-2023-01-05/",
    "urlImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=125",
    "hasImage": true,
    "comments": {
      "body": "Canada posted a trade deficit of C41 million 3032 million in November driven by lower exports of energy products with both imports and exports affected by the appreciation of the Canadian dollar Statistics Canada said on Thursday"
    }
  },
  "NewsApi-Arianne Leblanc Caitlin Kraemer lead Canada past Finland at women's under-18 world championship - TSN": {
    "type": "NewsApi",
    "title": "Arianne Leblanc Caitlin Kraemer lead Canada past Finland at women's under-18 world championship - TSN",
    "body": "<ol><li>Arianne Leblanc Caitlin Kraemer lead Canada past Finland at women's under-18 world championship  TSN\r\n</li><li>U18 Women's Worlds Preview: Canada vs. Finland  Hockey Canada\r\n</li><li>Eight O Canada  IIHF\r\n</li><li>Women's U-18 World Championship Day 1…",
    "url": "https://www.tsn.ca/hockey-canada/arianne-leblanc-caitlin-kraemer-lead-canada-past-finland-at-women-s-under-18-world-championship-1.1903362",
    "urlImage": "https://www.tsn.ca/content/dam/tsn/en/home/images/2023/1/8/canada-vs--finland---under-18-women-s-hockey-championship-1-1903446-1673227081876.jpeg",
    "hasImage": true,
    "comments": {
      "body": "olliArianne Leblanc Caitlin Kraemer lead Canada past Finland at womens under18 world championshipTSNliliU18 Womens Worlds Preview Canada vs FinlandHockey CanadaliliEight O CanadaIIHFliliWomens U18 World Championship Day 1"
    }
  },
  "NewsApi-Uber Eats now shows users which of their personal details couriers can see": {
    "type": "NewsApi",
    "title": "Uber Eats now shows users which of their personal details couriers can see",
    "body": "The next time you order something from Uber Eats\r\n, you'll be able to find out what personal information of yours a courier can see at each stage of the delivery process. The View as Delivery Person feature follows a View as Driver function Uber added in 2020…",
    "url": "https://www.engadget.com/uber-eats-view-as-delivery-person-privacy-safety-173943014.html",
    "urlImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-10/8a1d0420-4e24-11ed-b9bf-cae22544edde",
    "hasImage": true,
    "comments": {
      "body": "The next time you order something from Uber Eats youll be able to find out what personal information of yours a courier can see at each stage of the delivery process The View as Delivery Person feature follows a View as Driver function Uber added in 2020"
    }
  },
  "NewsApi-Bewitching green comet set to streak across Canada | Canada - Daily Hive": {
    "type": "NewsApi",
    "title": "Bewitching green comet set to streak across Canada | Canada - Daily Hive",
    "body": "<ol><li>Bewitching green comet set to streak across Canada | Canada  Daily Hive\r\n</li><li>Rare, green comet to pass by Earth for the first time in 50000 years  ABC7\r\n</li><li>How to spot rare green comet over Cochrane  CochraneNow.com\r\n</li><li>VIDEO: Comet p…",
    "url": "https://dailyhive.com/canada/green-comet-canada",
    "urlImage": "https://images.dailyhive.com/20230112152516/green-comet-500x258.jpg",
    "hasImage": true,
    "comments": {
      "body": "olliBewitching green comet set to streak across Canada  CanadaDaily HiveliliRare green comet to pass by Earth for the first time in 50000 yearsABC7liliHow to spot rare green comet over CochraneCochraneNowcomliliVIDEO Comet p"
    }
  },
  "NewsApi-Canada facing deeper recession as interest rates take hold: Deloitte - Yahoo Canada Finance": {
    "type": "NewsApi",
    "title": "Canada facing deeper recession as interest rates take hold: Deloitte - Yahoo Canada Finance",
    "body": "<ol><li>Canada facing deeper recession as interest rates take hold: Deloitte  Yahoo Canada Finance\r\n</li><li>Business and consumer sentiment sours, while inflationary pressures ease, BoC surveys find  The Globe and Mail\r\n</li><li>Recession will be 'deeper' th…",
    "url": "https://ca.finance.yahoo.com/news/canada-facing-deeper-recession-interest-rates-take-hold-deloitte-100134081.html",
    "urlImage": "https://s.yimg.com/ny/api/res/1.2/rGC0_lUNt1Ua6aCAZD6qGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-01/832f8660-95e6-11ed-bf5d-376577c89f93",
    "hasImage": true,
    "comments": {
      "body": "olliCanada facing deeper recession as interest rates take hold DeloitteYahoo Canada FinanceliliBusiness and consumer sentiment sours while inflationary pressures ease BoC surveys findThe Globe and MailliliRecession will be deeper th"
    }
  },
  "NewsApi-Court injunction suspends Brazilian homebuilder Gafisa's proposed ... - Reuters Canada": {
    "type": "NewsApi",
    "title": "Court injunction suspends Brazilian homebuilder Gafisa's proposed ... - Reuters Canada",
    "body": "A court injunction has suspended a proposed capital raise by Brazilian homebuilder Gafisa SA <a href=\"https://www.reuters.com/companies/GFSA3.SA\" target=\"_blank\">(GFSA3.SA)</a>, according to documents seen by Reuters.",
    "url": "https://www.reuters.com/world/americas/court-injunction-suspends-brazilian-homebuilder-gafisas-proposed-capital-raise-2023-01-05/",
    "urlImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=125",
    "hasImage": true,
    "comments": {
      "body": "A court injunction has suspended a proposed capital raise by Brazilian homebuilder Gafisa SA a hrefhttpswwwreuterscomcompaniesGFSA3SA targetblankGFSA3SAa according to documents seen by Reuters"
    }
  },
  "NewsApi-Top U.S. and Canada officials to attend Mexico summit - Reuters": {
    "type": "NewsApi",
    "title": "Top U.S. and Canada officials to attend Mexico summit - Reuters",
    "body": "A host of top cabinet officials from the United States and Canada will take part in a North American Leaders' Summit in Mexico City next week, Mexican Foreign Minister Marcelo Ebrard said on Thursday.",
    "url": "https://www.reuters.com/world/americas/top-us-canada-officials-attend-mexico-summit-2023-01-05/",
    "urlImage": "https://www.reuters.com/resizer/nharV8x6CoJWlQC9l9I0seL_tng=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/MQDBWA4PQRNG5CJYAL2PBK5VUU.jpg",
    "hasImage": true,
    "comments": {
      "body": "A host of top cabinet officials from the United States and Canada will take part in a North American Leaders Summit in Mexico City next week Mexican Foreign Minister Marcelo Ebrard said on Thursday"
    }
  },
  "NewsApi-Value of Canada building permits up 14.1% in November - Reuters.com": {
    "type": "NewsApi",
    "title": "Value of Canada building permits up 14.1% in November - Reuters.com",
    "body": "Jan 9 (Reuters) - The value of Canadian building permits rose by a 14.1% in November from October, Statistics Canada said on Monday.",
    "url": "https://www.reuters.com/world/americas/value-canada-building-permits-up-141-november-2023-01-09/",
    "urlImage": "https://www.reuters.com/resizer/zS44myoWTMJBV8lyBjOeaLrQmOA=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/Z7OMUS32NBI6JDWL6YJKY2XBXM.jpg",
    "hasImage": true,
    "comments": {
      "body": "Jan 9 Reuters  The value of Canadian building permits rose by a 141 in November from October Statistics Canada said on Monday"
    }
  },
  "NewsApi-Japan PM Kishida: 'keen' to strengthen cooperation with Canada - Reuters": {
    "type": "NewsApi",
    "title": "Japan PM Kishida: 'keen' to strengthen cooperation with Canada - Reuters",
    "body": "Japanese Prime Minister Fumio Kishida said on Thursday his economic policies align with those of Canada's and he was keen to strengthen cooperation between industries and governments in both countries.",
    "url": "https://www.reuters.com/world/asia-pacific/japan-pm-kishida-keen-strengthen-cooperation-with-canada-2023-01-12/",
    "urlImage": "https://www.reuters.com/resizer/iWqAqiGSuYb6ub1a-EKGPVGQQds=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/YAXSYG7M5ZMVTNGM362TUWM37A.jpg",
    "hasImage": true,
    "comments": {
      "body": "Japanese Prime Minister Fumio Kishida said on Thursday his economic policies align with those of Canadas and he was keen to strengthen cooperation between industries and governments in both countries"
    }
  },
  "NewsApi-Petrobras reinforces security at refineries after threats - sources - Reuters Canada": {
    "type": "NewsApi",
    "title": "Petrobras reinforces security at refineries after threats - sources - Reuters Canada",
    "body": "Petroleo Brasileiro SA <a href=\"https://www.reuters.com/companies/PETR4.SA\" target=\"_blank\">(PETR4.SA)</a> stepped up security at its refineries, in a cautionary measure after threats against assets including Brazil's biggest such fuel plant, two company offi…",
    "url": "https://www.reuters.com/world/americas/petrobras-reinforces-security-at-refineries-after-threats-sources-2023-01-09/",
    "urlImage": "https://www.reuters.com/resizer/tZxToZQu7OriOwvJgaiZCzjT8Yk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WMAGXNMTNNJQNPUOIMRBGURN4A.jpg",
    "hasImage": true,
    "comments": {
      "body": "Petroleo Brasileiro SA a hrefhttpswwwreuterscomcompaniesPETR4SA targetblankPETR4SAa stepped up security at its refineries in a cautionary measure after threats against assets including Brazils biggest such fuel plant two company offi"
    }
  },
  "NewsApi-Mexico's buck-toothed cartoon president ruled 'electoral violation' - Reuters Canada": {
    "type": "NewsApi",
    "title": "Mexico's buck-toothed cartoon president ruled 'electoral violation' - Reuters Canada",
    "body": "A buck-toothed cartoon version of Mexico's president constitutes an \"electoral violation,\" the country's electoral tribunal ruled Wednesday, arguing use of the popular caricature in official propaganda gave party candidates an unfair advantage.",
    "url": "https://www.reuters.com/world/americas/mexicos-buck-toothed-cartoon-president-ruled-electoral-violation-2023-01-12/",
    "urlImage": "https://www.reuters.com/resizer/MRls-28l9-nxKYI0tdN7r0053nE=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/3M6MCBCRWNLJHDF23TQS7T5EDU.jpg",
    "hasImage": true,
    "comments": {
      "body": "A bucktoothed cartoon version of Mexicos president constitutes an electoral violation the countrys electoral tribunal ruled Wednesday arguing use of the popular caricature in official propaganda gave party candidates an unfair advantage"
    }
  },
  "NewsApi-Mexico president names National Guard commander to senior ... - Reuters Canada": {
    "type": "NewsApi",
    "title": "Mexico president names National Guard commander to senior ... - Reuters Canada",
    "body": "Mexican President Andres Manuel Lopez Obrador named the commander of the country's National Guard as deputy security minister Monday, the latest in a string of appointments of former military members to serve in civilian roles.",
    "url": "https://www.reuters.com/world/americas/mexico-president-names-national-guard-commander-senior-security-role-2023-01-16/",
    "urlImage": "https://www.reuters.com/resizer/ko38uUV6wErBb67Zw5PRyOOEaWA=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/BNCBIDE6VBMQVHC3YKKQOBZGMQ.jpg",
    "hasImage": true,
    "comments": {
      "body": "Mexican President Andres Manuel Lopez Obrador named the commander of the countrys National Guard as deputy security minister Monday the latest in a string of appointments of former military members to serve in civilian roles"
    }
  },
  "NewsApi-El Salvador arrests Colombian linked to Paraguayan prosecutor's ... - Reuters Canada": {
    "type": "NewsApi",
    "title": "El Salvador arrests Colombian linked to Paraguayan prosecutor's ... - Reuters Canada",
    "body": "A Colombian suspect in the murder of a Paraguayan prosecutor last year was arrested in El Salvador and will be handed over to Colombian authorities, El Salvador's government said on Wednesday.",
    "url": "https://www.reuters.com/world/americas/el-salvador-arrests-colombian-linked-paraguayan-prosecutors-murder-2023-01-18/",
    "urlImage": "https://www.reuters.com/resizer/2o_a6X2zFudrs5EPUFYG5OlM8O0=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/JLJBVHE4AVOCXF2HY3ZSXPOJLI.jpg",
    "hasImage": true,
    "comments": {
      "body": "A Colombian suspect in the murder of a Paraguayan prosecutor last year was arrested in El Salvador and will be handed over to Colombian authorities El Salvadors government said on Wednesday"
    }
  },
  "NewsApi-Canada summons Russian ambassador over attacks on civilians in ... - Reuters": {
    "type": "NewsApi",
    "title": "Canada summons Russian ambassador over attacks on civilians in ... - Reuters",
    "body": "Canada's foreign minister said on Wednesday that Ottawa has summoned Russia's ambassador to Canada over Russian attacks against civilians in Ukraine, including an attack in Dnipro that killed at least 45 people.",
    "url": "https://www.reuters.com/world/europe/canada-summons-russian-ambassador-over-attacks-civilians-ukraine-2023-01-18/",
    "urlImage": "https://www.reuters.com/resizer/nYAZrks4QvA5YaMlCFpgKKXhI78=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/3BNNHXXNXFOOPLRWZFJ7566NZE.jpg",
    "hasImage": true,
    "comments": {
      "body": "Canadas foreign minister said on Wednesday that Ottawa has summoned Russias ambassador to Canada over Russian attacks against civilians in Ukraine including an attack in Dnipro that killed at least 45 people"
    }
  },
  "NewsApi-U.S., Canada, Australia to impose new sanctions on Myanmar - Reuters": {
    "type": "NewsApi",
    "title": "U.S., Canada, Australia to impose new sanctions on Myanmar - Reuters",
    "body": "The United States will impose further sanctions on Myanmar on Tuesday, according to a U.S. Treasury Department statement seen by Reuters, marking the two-year anniversary of the coup in partnership with U.S. allies.",
    "url": "https://www.reuters.com/world/asia-pacific/us-canada-australia-impose-new-sanctions-myanmar-2023-01-31/",
    "urlImage": "https://www.reuters.com/resizer/tBDso8PVOq_do2MalpPYTIw__ws=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/N2DVK4WOPJIJJCXKD5UAU4LXAM.jpg",
    "hasImage": true,
    "comments": {
      "body": "The United States will impose further sanctions on Myanmar on Tuesday according to a US Treasury Department statement seen by Reuters marking the twoyear anniversary of the coup in partnership with US allies"
    }
  },
  "NewsApi-Lula replaces Brazil's army commander, source says - Reuters Canada": {
    "type": "NewsApi",
    "title": "Lula replaces Brazil's army commander, source says - Reuters Canada",
    "body": "Brazilian President Luiz Inacio Lula da Silva fired the army commander, General Julio Cesar de Arruda, on Saturday, a source with knowledge of the matter said.",
    "url": "https://www.reuters.com/world/americas/brazils-lula-replaces-army-commander-source-2023-01-21/",
    "urlImage": "https://www.reuters.com/resizer/ne-n4s_LZLA2yB1TW6eE4nL1sEc=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/3IONBOL22FJZ7D67QJFFWNMJUE.jpg",
    "hasImage": true,
    "comments": {
      "body": "Brazilian President Luiz Inacio Lula da Silva fired the army commander General Julio Cesar de Arruda on Saturday a source with knowledge of the matter said"
    }
  }
}